-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th5 10, 2026 lúc 06:47 AM
-- Phiên bản máy phục vụ: 10.4.32-MariaDB
-- Phiên bản PHP: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `qldsv`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `account`
--

CREATE TABLE `account` (
  `id` int(4) NOT NULL,
  `code` varchar(5) NOT NULL,
  `username` varchar(20) NOT NULL,
  `password` varchar(255) NOT NULL,
  `password_hint` varchar(16) NOT NULL,
  `role` enum('admin','teacher','student') NOT NULL DEFAULT 'student'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `account`
--

INSERT INTO `account` (`id`, `code`, `username`, `password`, `password_hint`, `role`) VALUES
(1, 'ADMIN', 'admin123', '$2y$10$Hc1ge4cgN1HbGjiQoygozOye6c4sx.HF2sewH1Q/Qd82m6RbYrTiG', 'admin123', 'admin'),
(2, 'GV01', 'teacher', '$2y$10$FKyrLwj0czTpG27QTJUxJO8TIdacdUEJJf0EIjc0Gels8d90CoRQS', 'abc123', 'teacher'),
(3, 'SV01', 'student01', '$2y$10$b8PJ5HmmeANqOZxomCUImekM7mUKqaQfxNqaAbbKO5TF9.n6sl86m', '12345678', 'student'),
(8, 'SV02', 'sinhvien', '$2y$10$G7bDJceFpYXsjAJoHc2xOOjYWj9zKXYJmlPb87CYPMH.Sst4dir8.', 'sinhvien', 'student'),
(9, 'GV02', 'giangvien', '$2y$10$z92NPamg72lVvPyJeqzrteE3yx/Th1hosMIoV9kGH0bXey6yVst2m', 'giangvien', 'teacher'),
(12, 'SV03', 'dta2202', '$2y$10$Q6WrehLNyESqSB43oVAAh.pwpkqnT2ajeWu4Q1JeiUGznAQMD8zf2', 'dinhanh2202', 'student'),
(14, 'SV05', 'test1', '$2y$10$/qOtMr15h966jsVzd0.t5eX1iUsbBToAxAqCEe1szAs2A.y3heS8q', '123456', 'student'),
(15, 'SV06', 'test2', '$2y$10$W4gehE584cWbmCHaIYeQnuyhPkssx2ZvgmWrP2ZXtgdz9BuoyuuD.', '123456', 'student'),
(16, 'SV04', 'tktest', '', '123456', 'student'),
(20, 'SV07', 'svtest', '$2y$10$obevgapNB2WFZIiMzHkdcOd9eiEN6USL9ZlyWEpU/xblUReUYXUnu', '123456', 'student'),
(21, 'SV08', 'testsv', '$2y$10$pH5HZAlunhhuMmPeJ4lVzuPuMfAeYyKWUkEujisX7iepZF.gYVNmS', '123456', 'student'),
(22, 'GV03', 'gvtest', '$2y$10$X4FUddlybSBTCRtR0VL0IuIfDpqUEBTlaS/e21vw6aC9GLdx2y3Ke', '123456', 'teacher');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `assignments`
--

CREATE TABLE `assignments` (
  `id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `type` enum('Bài tập','Bài kiểm tra') NOT NULL,
  `deadline` datetime DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `assignments`
--

INSERT INTO `assignments` (`id`, `class_id`, `title`, `description`, `type`, `deadline`, `created_at`) VALUES
(1, 3, 'Bài tập chương 1', '', 'Bài tập', '2026-05-08 22:26:00', '2026-05-08 15:34:46'),
(2, 3, 'Kiểm tra giữa kỳ', '', 'Bài kiểm tra', '2026-05-30 10:30:00', '2026-05-08 15:35:33'),
(3, 3, 'Test', '', 'Bài tập', '2026-05-30 10:30:00', '2026-05-08 15:35:56'),
(6, 3, 'Bài thử', '', 'Bài tập', '2026-05-08 22:45:00', '2026-05-08 15:43:59'),
(7, 3, 'Final', '', 'Bài kiểm tra', '2026-05-08 22:45:00', '2026-05-08 15:44:27'),
(8, 75, 'Nộp phiếu đánh giá', 'Lấy điểm quá trình', 'Bài kiểm tra', '2026-05-11 08:00:00', '2026-05-09 18:44:01'),
(9, 75, 'Bài giữa kỳ', 'Nộp phiếu đánh giá lấy điểm quá trình và giữa kỳ', 'Bài kiểm tra', '2026-05-11 12:00:00', '2026-05-09 18:49:33');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `attendance`
--

CREATE TABLE `attendance` (
  `id` int(11) NOT NULL,
  `session_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `status` enum('Có mặt','Muộn/Về sớm','Vắng có phép','Vắng không phép','Chưa điểm danh') DEFAULT 'Chưa điểm danh',
  `note` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `attendance`
--

INSERT INTO `attendance` (`id`, `session_id`, `student_id`, `status`, `note`) VALUES
(4, 169, 3, 'Có mặt', NULL),
(5, 175, 3, 'Có mặt', NULL),
(6, 181, 3, 'Có mặt', NULL),
(7, 187, 3, 'Có mặt', NULL),
(8, 193, 3, 'Có mặt', NULL),
(9, 199, 3, 'Có mặt', NULL),
(10, 205, 3, 'Có mặt', NULL),
(11, 211, 3, 'Có mặt', NULL),
(12, 41, 3, 'Có mặt', NULL),
(13, 45, 3, 'Có mặt', NULL),
(14, 49, 3, 'Có mặt', NULL),
(15, 53, 3, 'Có mặt', NULL),
(16, 57, 3, 'Có mặt', NULL),
(17, 61, 3, 'Có mặt', NULL),
(18, 65, 3, 'Có mặt', NULL),
(19, 69, 3, 'Có mặt', NULL),
(20, 43, 3, 'Có mặt', NULL),
(21, 47, 3, 'Có mặt', NULL),
(22, 51, 3, 'Có mặt', NULL),
(23, 55, 3, 'Có mặt', NULL),
(24, 59, 3, 'Có mặt', NULL),
(25, 63, 3, 'Có mặt', NULL),
(26, 67, 3, 'Có mặt', NULL),
(27, 71, 3, 'Có mặt', NULL),
(28, 232, 3, 'Có mặt', NULL),
(29, 240, 3, 'Có mặt', NULL),
(30, 248, 3, 'Có mặt', NULL),
(31, 256, 3, 'Có mặt', NULL),
(32, 264, 3, 'Có mặt', NULL),
(33, 272, 3, 'Có mặt', NULL),
(34, 280, 3, 'Có mặt', NULL),
(35, 288, 3, 'Có mặt', NULL),
(36, 234, 3, 'Có mặt', NULL),
(37, 242, 3, 'Có mặt', NULL),
(38, 250, 3, 'Có mặt', NULL),
(39, 258, 3, 'Có mặt', NULL),
(40, 266, 3, 'Có mặt', NULL),
(41, 274, 3, 'Có mặt', NULL),
(42, 282, 3, 'Có mặt', NULL),
(43, 290, 3, 'Có mặt', NULL),
(44, 171, 3, 'Có mặt', NULL),
(45, 177, 3, 'Có mặt', NULL),
(46, 183, 3, 'Có mặt', NULL),
(47, 189, 3, 'Có mặt', NULL),
(48, 195, 3, 'Có mặt', NULL),
(49, 201, 3, 'Có mặt', NULL),
(50, 207, 3, 'Có mặt', NULL),
(51, 213, 3, 'Có mặt', NULL),
(52, 108, 3, 'Có mặt', NULL),
(53, 115, 3, 'Có mặt', NULL),
(54, 122, 3, 'Có mặt', NULL),
(55, 129, 3, 'Có mặt', NULL),
(56, 136, 3, 'Có mặt', NULL),
(57, 143, 3, 'Có mặt', NULL),
(58, 150, 3, 'Có mặt', NULL),
(59, 157, 3, 'Có mặt', NULL),
(60, 170, 3, 'Có mặt', NULL),
(61, 176, 3, 'Có mặt', NULL),
(62, 182, 3, 'Có mặt', NULL),
(63, 188, 3, 'Có mặt', NULL),
(64, 194, 3, 'Có mặt', NULL),
(65, 200, 3, 'Có mặt', NULL),
(66, 206, 3, 'Có mặt', NULL),
(67, 212, 3, 'Có mặt', NULL),
(68, 106, 3, 'Có mặt', NULL),
(69, 113, 3, 'Có mặt', NULL),
(70, 120, 3, 'Có mặt', NULL),
(71, 127, 3, 'Có mặt', NULL),
(72, 134, 3, 'Có mặt', NULL),
(73, 141, 3, 'Có mặt', NULL),
(74, 148, 3, 'Có mặt', NULL),
(75, 155, 3, 'Có mặt', NULL),
(76, 166, 3, 'Có mặt', NULL),
(77, 172, 3, 'Có mặt', NULL),
(78, 178, 3, 'Có mặt', NULL),
(79, 184, 3, 'Có mặt', NULL),
(80, 190, 3, 'Có mặt', NULL),
(81, 196, 3, 'Có mặt', NULL),
(82, 202, 3, 'Có mặt', NULL),
(83, 208, 3, 'Có mặt', NULL),
(84, 236, 3, 'Có mặt', NULL),
(85, 244, 3, 'Có mặt', NULL),
(86, 252, 3, 'Có mặt', NULL),
(87, 260, 3, 'Có mặt', NULL),
(88, 268, 3, 'Có mặt', NULL),
(89, 276, 3, 'Có mặt', NULL),
(90, 284, 3, 'Có mặt', NULL),
(91, 292, 3, 'Có mặt', NULL),
(92, 235, 3, 'Có mặt', NULL),
(93, 243, 3, 'Có mặt', NULL),
(94, 251, 3, 'Có mặt', NULL),
(95, 259, 3, 'Có mặt', NULL),
(96, 267, 3, 'Có mặt', NULL),
(97, 275, 3, 'Có mặt', NULL),
(98, 283, 3, 'Có mặt', NULL),
(99, 291, 3, 'Có mặt', NULL),
(100, 233, 3, 'Có mặt', NULL),
(101, 241, 3, 'Có mặt', NULL),
(102, 249, 3, 'Có mặt', NULL),
(103, 257, 3, 'Có mặt', NULL),
(104, 265, 3, 'Có mặt', NULL),
(105, 273, 3, 'Có mặt', NULL),
(106, 281, 3, 'Có mặt', NULL),
(107, 289, 3, 'Có mặt', NULL),
(108, 103, 3, 'Có mặt', NULL),
(109, 110, 3, 'Có mặt', NULL),
(110, 117, 3, 'Có mặt', NULL),
(111, 124, 3, 'Có mặt', NULL),
(112, 131, 3, 'Có mặt', NULL),
(113, 138, 3, 'Có mặt', NULL),
(114, 145, 3, 'Có mặt', NULL),
(115, 152, 3, 'Có mặt', NULL),
(116, 231, 3, 'Có mặt', NULL),
(117, 239, 3, 'Có mặt', NULL),
(118, 247, 3, 'Có mặt', NULL),
(119, 255, 3, 'Có mặt', NULL),
(120, 263, 3, 'Có mặt', NULL),
(121, 271, 3, 'Có mặt', NULL),
(122, 279, 3, 'Có mặt', NULL),
(123, 287, 3, 'Có mặt', NULL),
(124, 167, 3, 'Có mặt', NULL),
(125, 173, 3, 'Có mặt', NULL),
(126, 179, 3, 'Có mặt', NULL),
(127, 185, 3, 'Có mặt', NULL),
(128, 191, 3, 'Có mặt', NULL),
(129, 197, 3, 'Có mặt', NULL),
(130, 203, 3, 'Có mặt', NULL),
(131, 209, 3, 'Có mặt', NULL),
(132, 168, 3, 'Có mặt', NULL),
(133, 174, 3, 'Có mặt', NULL),
(134, 180, 3, 'Có mặt', NULL),
(135, 186, 3, 'Có mặt', NULL),
(136, 192, 3, 'Có mặt', NULL),
(137, 198, 3, 'Có mặt', NULL),
(138, 204, 3, 'Có mặt', NULL),
(139, 210, 3, 'Có mặt', NULL),
(140, 357, 3, 'Có mặt', NULL),
(141, 363, 3, 'Có mặt', NULL),
(142, 369, 3, 'Có mặt', NULL),
(143, 375, 3, 'Có mặt', NULL),
(144, 381, 3, 'Có mặt', NULL),
(145, 387, 3, 'Có mặt', NULL),
(146, 393, 3, 'Có mặt', NULL),
(147, 399, 3, 'Có mặt', NULL),
(148, 360, 3, 'Có mặt', NULL),
(149, 366, 3, 'Có mặt', NULL),
(150, 372, 3, 'Có mặt', NULL),
(151, 378, 3, 'Có mặt', NULL),
(152, 384, 3, 'Có mặt', NULL),
(153, 390, 3, 'Có mặt', NULL),
(154, 396, 3, 'Có mặt', NULL),
(155, 402, 3, 'Có mặt', NULL),
(156, 229, 3, 'Có mặt', NULL),
(157, 237, 3, 'Có mặt', NULL),
(158, 245, 3, 'Có mặt', NULL),
(159, 253, 3, 'Có mặt', NULL),
(160, 261, 3, 'Có mặt', NULL),
(161, 269, 3, 'Có mặt', NULL),
(162, 277, 3, 'Có mặt', NULL),
(163, 285, 3, 'Có mặt', NULL),
(164, 40, 3, 'Có mặt', NULL),
(165, 44, 3, 'Có mặt', NULL),
(166, 48, 3, 'Có mặt', NULL),
(167, 52, 3, 'Có mặt', NULL),
(168, 56, 3, 'Có mặt', NULL),
(169, 60, 3, 'Có mặt', NULL),
(170, 64, 3, 'Có mặt', NULL),
(171, 68, 3, 'Có mặt', NULL),
(172, 230, 3, 'Có mặt', NULL),
(173, 238, 3, 'Có mặt', NULL),
(174, 246, 3, 'Có mặt', NULL),
(175, 254, 3, 'Có mặt', NULL),
(176, 262, 3, 'Có mặt', NULL),
(177, 270, 3, 'Có mặt', NULL),
(178, 278, 3, 'Có mặt', NULL),
(179, 286, 3, 'Có mặt', NULL),
(180, 42, 3, 'Có mặt', NULL),
(181, 46, 3, 'Có mặt', NULL),
(182, 50, 3, 'Có mặt', NULL),
(183, 54, 3, 'Có mặt', NULL),
(184, 58, 3, 'Có mặt', NULL),
(185, 62, 3, 'Có mặt', NULL),
(186, 66, 3, 'Có mặt', NULL),
(187, 70, 3, 'Có mặt', NULL),
(188, 107, 3, 'Có mặt', NULL),
(189, 114, 3, 'Có mặt', NULL),
(190, 121, 3, 'Có mặt', NULL),
(191, 128, 3, 'Có mặt', NULL),
(192, 135, 3, 'Có mặt', NULL),
(193, 142, 3, 'Có mặt', NULL),
(194, 149, 3, 'Có mặt', NULL),
(195, 156, 3, 'Có mặt', NULL),
(196, 601, 3, 'Có mặt', NULL),
(197, 602, 3, 'Có mặt', NULL),
(198, 603, 3, 'Có mặt', NULL),
(199, 604, 3, 'Có mặt', NULL),
(200, 605, 3, 'Có mặt', NULL),
(201, 606, 3, 'Có mặt', NULL),
(202, 607, 3, 'Có mặt', NULL),
(203, 608, 3, 'Có mặt', NULL),
(204, 459, 3, 'Có mặt', NULL),
(205, 460, 3, 'Có mặt', NULL),
(206, 461, 3, 'Có mặt', NULL),
(207, 462, 3, 'Có mặt', NULL),
(208, 463, 3, 'Có mặt', NULL),
(209, 464, 3, 'Có mặt', NULL),
(210, 465, 3, 'Có mặt', NULL),
(211, 466, 3, 'Có mặt', NULL),
(212, 467, 3, 'Có mặt', NULL),
(213, 468, 3, 'Có mặt', NULL),
(214, 469, 3, 'Có mặt', NULL),
(215, 470, 3, 'Có mặt', NULL),
(216, 471, 3, 'Có mặt', NULL),
(217, 472, 3, 'Có mặt', NULL),
(218, 473, 3, 'Có mặt', NULL),
(219, 474, 3, 'Có mặt', NULL),
(220, 585, 3, 'Có mặt', NULL),
(221, 586, 3, 'Có mặt', NULL),
(222, 587, 3, 'Có mặt', NULL),
(223, 588, 3, 'Có mặt', NULL),
(224, 589, 3, 'Có mặt', NULL),
(225, 590, 3, 'Có mặt', NULL),
(226, 591, 3, 'Có mặt', NULL),
(227, 592, 3, 'Có mặt', NULL),
(228, 569, 3, 'Có mặt', NULL),
(229, 570, 3, 'Có mặt', NULL),
(230, 571, 3, 'Có mặt', NULL),
(231, 572, 3, 'Có mặt', NULL),
(232, 573, 3, 'Có mặt', NULL),
(233, 574, 3, 'Có mặt', NULL),
(234, 575, 3, 'Có mặt', NULL),
(235, 576, 3, 'Có mặt', NULL),
(236, 435, 3, 'Có mặt', NULL),
(237, 436, 3, 'Có mặt', NULL),
(238, 437, 3, 'Có mặt', NULL),
(239, 438, 3, 'Có mặt', NULL),
(240, 439, 3, 'Có mặt', NULL),
(241, 440, 3, 'Có mặt', NULL),
(242, 441, 3, 'Có mặt', NULL),
(243, 442, 3, 'Có mặt', NULL),
(244, 358, 3, 'Có mặt', NULL),
(245, 364, 3, 'Có mặt', NULL),
(246, 370, 3, 'Có mặt', NULL),
(247, 376, 3, 'Có mặt', NULL),
(248, 382, 3, 'Có mặt', NULL),
(249, 388, 3, 'Có mặt', NULL),
(250, 394, 3, 'Có mặt', NULL),
(251, 400, 3, 'Có mặt', NULL),
(252, 546, 3, 'Có mặt', NULL),
(253, 547, 3, 'Có mặt', NULL),
(254, 548, 3, 'Có mặt', NULL),
(255, 549, 3, 'Có mặt', NULL),
(256, 550, 3, 'Có mặt', NULL),
(257, 551, 3, 'Có mặt', NULL),
(258, 552, 3, 'Có mặt', NULL),
(259, 553, 3, 'Có mặt', NULL),
(260, 507, 3, 'Có mặt', NULL),
(261, 508, 3, 'Có mặt', NULL),
(262, 509, 3, 'Có mặt', NULL),
(263, 510, 3, 'Có mặt', NULL),
(264, 511, 3, 'Có mặt', NULL),
(265, 512, 3, 'Có mặt', NULL),
(266, 513, 3, 'Có mặt', NULL),
(267, 514, 3, 'Có mặt', NULL),
(268, 515, 3, 'Có mặt', NULL),
(269, 516, 3, 'Có mặt', NULL),
(270, 517, 3, 'Có mặt', NULL),
(271, 518, 3, 'Có mặt', NULL),
(272, 519, 3, 'Có mặt', NULL),
(273, 520, 3, 'Có mặt', NULL),
(274, 521, 3, 'Có mặt', NULL),
(275, 522, 3, 'Có mặt', NULL),
(276, 499, 3, 'Có mặt', NULL),
(277, 500, 3, 'Có mặt', NULL),
(278, 501, 3, 'Có mặt', NULL),
(279, 502, 3, 'Có mặt', NULL),
(280, 503, 3, 'Có mặt', NULL),
(281, 504, 3, 'Có mặt', NULL),
(282, 505, 3, 'Có mặt', NULL),
(283, 506, 3, 'Có mặt', NULL),
(284, 427, 3, 'Có mặt', NULL),
(285, 428, 3, 'Có mặt', NULL),
(286, 429, 3, 'Có mặt', NULL),
(287, 430, 3, 'Có mặt', NULL),
(288, 431, 3, 'Có mặt', NULL),
(289, 432, 3, 'Có mặt', NULL),
(290, 433, 3, 'Có mặt', NULL),
(291, 434, 3, 'Có mặt', NULL),
(292, 443, 3, 'Có mặt', NULL),
(293, 444, 3, 'Có mặt', NULL),
(294, 445, 3, 'Có mặt', NULL),
(295, 446, 3, 'Có mặt', NULL),
(296, 447, 3, 'Có mặt', NULL),
(297, 448, 3, 'Có mặt', NULL),
(298, 449, 3, 'Có mặt', NULL),
(299, 450, 3, 'Có mặt', NULL),
(300, 104, 3, 'Có mặt', NULL),
(301, 111, 3, 'Có mặt', NULL),
(302, 118, 3, 'Có mặt', NULL),
(303, 125, 3, 'Có mặt', NULL),
(304, 132, 3, 'Có mặt', NULL),
(305, 139, 3, 'Có mặt', NULL),
(306, 146, 3, 'Có mặt', NULL),
(307, 153, 3, 'Có mặt', NULL),
(308, 561, 3, 'Có mặt', NULL),
(309, 562, 3, 'Có mặt', NULL),
(310, 563, 3, 'Có mặt', NULL),
(311, 564, 3, 'Có mặt', NULL),
(312, 565, 3, 'Có mặt', NULL),
(313, 566, 3, 'Có mặt', NULL),
(314, 567, 3, 'Có mặt', NULL),
(315, 568, 3, 'Có mặt', NULL),
(316, 577, 3, 'Có mặt', NULL),
(317, 578, 3, 'Có mặt', NULL),
(318, 579, 3, 'Có mặt', NULL),
(319, 580, 3, 'Có mặt', NULL),
(320, 581, 3, 'Có mặt', NULL),
(321, 582, 3, 'Có mặt', NULL),
(322, 583, 3, 'Có mặt', NULL),
(323, 584, 3, 'Có mặt', NULL),
(324, 593, 3, 'Có mặt', NULL),
(325, 594, 3, 'Có mặt', NULL),
(326, 595, 3, 'Có mặt', NULL),
(327, 596, 3, 'Có mặt', NULL),
(328, 597, 3, 'Có mặt', NULL),
(329, 598, 3, 'Có mặt', NULL),
(330, 599, 3, 'Có mặt', NULL),
(331, 600, 3, 'Có mặt', NULL),
(332, 419, 3, 'Có mặt', NULL),
(333, 420, 3, 'Có mặt', NULL),
(334, 421, 3, 'Có mặt', NULL),
(335, 422, 3, 'Có mặt', NULL),
(336, 423, 3, 'Có mặt', NULL),
(337, 424, 3, 'Có mặt', NULL),
(338, 425, 3, 'Có mặt', NULL),
(339, 426, 3, 'Có mặt', NULL),
(340, 688, 3, 'Có mặt', NULL),
(341, 689, 3, 'Có mặt', NULL),
(342, 690, 3, 'Có mặt', NULL),
(343, 691, 3, 'Có mặt', NULL),
(344, 692, 3, 'Có mặt', NULL),
(345, 693, 3, 'Có mặt', NULL),
(346, 694, 3, 'Có mặt', NULL),
(347, 695, 3, 'Có mặt', NULL),
(348, 523, 3, 'Có mặt', NULL),
(349, 524, 3, 'Có mặt', NULL),
(350, 525, 3, 'Có mặt', NULL),
(351, 526, 3, 'Có mặt', NULL),
(352, 527, 3, 'Có mặt', NULL),
(353, 528, 3, 'Có mặt', NULL),
(354, 529, 3, 'Có mặt', NULL),
(355, 530, 3, 'Có mặt', NULL),
(356, 625, 3, 'Có mặt', NULL),
(357, 626, 3, 'Có mặt', NULL),
(358, 627, 3, 'Có mặt', NULL),
(359, 628, 3, 'Có mặt', NULL),
(360, 629, 3, 'Có mặt', NULL),
(361, 630, 3, 'Có mặt', NULL),
(362, 631, 3, 'Có mặt', NULL),
(363, 632, 3, 'Có mặt', NULL),
(364, 617, 3, 'Có mặt', NULL),
(365, 618, 3, 'Có mặt', NULL),
(366, 619, 3, 'Có mặt', NULL),
(367, 620, 3, 'Có mặt', NULL),
(368, 621, 3, 'Có mặt', NULL),
(369, 622, 3, 'Có mặt', NULL),
(370, 623, 3, 'Có mặt', NULL),
(371, 624, 3, 'Có mặt', NULL),
(372, 609, 3, 'Có mặt', NULL),
(373, 610, 3, 'Có mặt', NULL),
(374, 611, 3, 'Có mặt', NULL),
(375, 612, 3, 'Có mặt', NULL),
(376, 613, 3, 'Có mặt', NULL),
(377, 614, 3, 'Có mặt', NULL),
(378, 615, 3, 'Có mặt', NULL),
(379, 616, 3, 'Có mặt', NULL),
(380, 105, 3, 'Có mặt', NULL),
(381, 112, 3, 'Có mặt', NULL),
(382, 119, 3, 'Có mặt', NULL),
(383, 126, 3, 'Có mặt', NULL),
(384, 133, 3, 'Có mặt', NULL),
(385, 140, 3, 'Có mặt', NULL),
(386, 147, 3, 'Có mặt', NULL),
(387, 154, 3, 'Có mặt', NULL),
(388, 109, 3, 'Có mặt', NULL),
(389, 116, 3, 'Có mặt', NULL),
(390, 123, 3, 'Có mặt', NULL),
(391, 130, 3, 'Có mặt', NULL),
(392, 137, 3, 'Có mặt', NULL),
(393, 144, 3, 'Có mặt', NULL),
(394, 151, 3, 'Có mặt', NULL),
(395, 158, 3, 'Có mặt', NULL),
(396, 475, 3, 'Có mặt', NULL),
(397, 476, 3, 'Có mặt', NULL),
(398, 477, 3, 'Có mặt', NULL),
(399, 478, 3, 'Có mặt', NULL),
(400, 479, 3, 'Có mặt', NULL),
(401, 480, 3, 'Có mặt', NULL),
(402, 481, 3, 'Có mặt', NULL),
(403, 482, 3, 'Có mặt', NULL),
(404, 356, 3, 'Có mặt', NULL),
(405, 362, 3, 'Có mặt', NULL),
(406, 368, 3, 'Có mặt', NULL),
(407, 374, 3, 'Có mặt', NULL),
(408, 380, 3, 'Có mặt', NULL),
(409, 386, 3, 'Có mặt', NULL),
(410, 392, 3, 'Có mặt', NULL),
(411, 398, 3, 'Có mặt', NULL),
(412, 359, 3, 'Có mặt', NULL),
(413, 365, 3, 'Có mặt', NULL),
(414, 371, 3, 'Có mặt', NULL),
(415, 377, 3, 'Có mặt', NULL),
(416, 383, 3, 'Có mặt', NULL),
(417, 389, 3, 'Có mặt', NULL),
(418, 395, 3, 'Có mặt', NULL),
(419, 401, 3, 'Có mặt', NULL),
(420, 483, 3, 'Có mặt', NULL),
(421, 484, 3, 'Có mặt', NULL),
(422, 485, 3, 'Có mặt', NULL),
(423, 486, 3, 'Có mặt', NULL),
(424, 487, 3, 'Có mặt', NULL),
(425, 488, 3, 'Có mặt', NULL),
(426, 489, 3, 'Có mặt', NULL),
(427, 490, 3, 'Có mặt', NULL),
(428, 361, 3, 'Có mặt', NULL),
(429, 367, 3, 'Có mặt', NULL),
(430, 373, 3, 'Có mặt', NULL),
(431, 379, 3, 'Có mặt', NULL),
(432, 385, 3, 'Có mặt', NULL),
(433, 391, 3, 'Có mặt', NULL),
(434, 397, 3, 'Có mặt', NULL),
(435, 403, 3, 'Có mặt', NULL),
(436, 491, 3, 'Có mặt', NULL),
(437, 492, 3, 'Có mặt', NULL),
(438, 493, 3, 'Có mặt', NULL),
(439, 494, 3, 'Có mặt', NULL),
(440, 495, 3, 'Có mặt', NULL),
(441, 496, 3, 'Có mặt', NULL),
(442, 497, 3, 'Có mặt', NULL),
(443, 498, 3, 'Có mặt', NULL),
(515, 749, 3, 'Có mặt', NULL),
(516, 750, 3, 'Có mặt', NULL),
(517, 751, 3, 'Có mặt', NULL),
(518, 752, 3, 'Có mặt', NULL),
(519, 753, 3, 'Có mặt', NULL),
(520, 754, 3, 'Có mặt', NULL),
(521, 755, 3, 'Có mặt', NULL),
(522, 756, 3, 'Có mặt', NULL),
(523, 797, 3, 'Có mặt', NULL),
(524, 800, 3, 'Có mặt', NULL),
(525, 803, 3, 'Có mặt', NULL),
(526, 806, 3, 'Có mặt', NULL),
(527, 809, 3, 'Có mặt', NULL),
(528, 812, 3, 'Có mặt', NULL),
(529, 796, 3, 'Có mặt', NULL),
(530, 799, 3, 'Có mặt', NULL),
(531, 802, 3, 'Có mặt', NULL),
(532, 805, 3, 'Có mặt', NULL),
(533, 808, 3, 'Có mặt', NULL),
(534, 811, 3, 'Có mặt', NULL),
(535, 795, 3, 'Có mặt', NULL),
(536, 798, 3, 'Có mặt', NULL),
(537, 801, 3, 'Có mặt', NULL),
(538, 804, 3, 'Có mặt', NULL),
(539, 807, 3, 'Có mặt', NULL),
(540, 810, 3, 'Có mặt', NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `classes`
--

CREATE TABLE `classes` (
  `id` int(11) NOT NULL,
  `subject_id` int(11) NOT NULL,
  `class_code` varchar(20) NOT NULL,
  `class_name` varchar(255) NOT NULL,
  `semester` int(11) NOT NULL,
  `group_id` int(11) DEFAULT 1,
  `account_id` int(4) NOT NULL,
  `status` enum('Chưa bắt đầu','Đang học','Đã kết thúc') DEFAULT 'Chưa bắt đầu',
  `goals` text DEFAULT NULL,
  `weights` text DEFAULT NULL,
  `materials` text DEFAULT NULL,
  `online_link` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `deadline` datetime DEFAULT NULL,
  `syllabus_path` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `classes`
--

INSERT INTO `classes` (`id`, `subject_id`, `class_code`, `class_name`, `semester`, `group_id`, `account_id`, `status`, `goals`, `weights`, `materials`, `online_link`, `created_at`, `deadline`, `syllabus_path`) VALUES
(1, 3, 'DHIT04', 'Lập trình C++', 20222, 1, 2, 'Đã kết thúc', '- Nắm vững cú pháp C++ cơ bản\n- Hiểu và áp dụng được Lập trình hướng đối tượng (OOP)\n- Quản lý bộ nhớ và con trỏ.', '- Chuyên cần: 10%\n- Bài tập lớn: 30%\n- Thi cuối kỳ: 60%', '- Giáo trình Lập trình C++ (Trường ĐH Công nghệ)\n- Slide bài giảng chương 1-8\n- Bài tập thực hành mẫu.', 'https://meet.google.com/dhit-03-cpp', '2026-05-01 09:54:47', '2026-05-09 21:53:29', NULL),
(3, 1, 'DHIT15', 'Ngôn ngữ HTML, CSS, JavaScript', 20231, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-03 14:22:52', '2026-05-09 21:53:29', NULL),
(5, 8, 'DHIT08', 'Kiến trúc máy tính', 20221, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(6, 9, 'DHIT33', 'Tin học đại cương', 20221, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(7, 11, 'DHIT49', 'Phương pháp nghiên cứu khoa học', 20221, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(8, 12, 'DHIT03', 'Đại số', 20221, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(9, 13, 'DHIT19', 'Lắp ráp, cài đặt bảo trì máy tính', 20221, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(10, 20, 'DHIT01', 'Giải tích', 20221, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(11, 56, 'DHLD56', 'Pháp luật đại cương về truyền thông', 20221, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(12, 2, 'DHIT10', 'Nhập môn CSDL', 20222, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(13, 4, 'DHIT11', 'Nhập môn mạng máy tính', 20222, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(14, 14, 'DHCT13', 'Triết học Mác - Lênin', 20222, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(15, 15, 'DHIT02', 'Lý thuyết xác suất thống kê toán', 20222, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(16, 22, 'DHGS09', 'Giới trong khoa học và công nghệ', 20222, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(17, 19, 'DHCT14', 'Kinh tế chính trị Mác - Lênin', 20231, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(18, 21, 'DHIT18', 'Ngôn ngữ SQL', 20231, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(19, 23, 'DHCT15', 'Chủ nghĩa xã hội khoa học', 20231, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(20, 25, 'DHIT14', 'Kỹ nghệ phần mềm', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(21, 26, 'DHIT16', 'Đồ họa máy tính', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(22, 27, 'DHIT09', 'Cấu trúc dữ liệu và giải thuật', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(23, 28, 'DHCT16', 'Lịch sử Đảng Cộng sản Việt Nam', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(24, 29, 'DHIT07', 'Phân tích thiết kế hệ thống thông tin', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(25, 30, 'DHCT17', 'Tư tưởng Hồ Chí Minh', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(26, 31, 'DHIT06', 'Phương pháp tính toán số', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(27, 32, 'DHIT05', 'Toán rời rạc', 20232, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:25:58', '2026-05-09 21:53:29', NULL),
(28, 33, 'DHNT31', 'Tiếng Anh chuyên ngành CNTT', 20241, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(29, 34, 'DHIT12', 'Lập trình hướng đối tượng', 20241, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(30, 35, 'DHIT26', 'An toàn và bảo mật thông tin', 20241, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(31, 36, 'DHPR28', 'Thương mại điện tử', 20241, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(32, 37, 'DHIT13', 'Môi trường lập trình trực quan VB, VBA', 20241, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(33, 38, 'DHTH61', 'Khởi nghiệp kinh doanh', 20241, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(34, 39, 'DHIT37', 'Trí tuệ nhân tạo', 20242, 1, 9, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(35, 40, 'DHIT31', 'Lập trình trên thiết bị di động', 20242, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(36, 41, 'DHIT25', 'Phân tích dữ liệu lớn', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(37, 43, 'DHIT32', 'Ngôn ngữ mô hình hóa UML', 20242, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(38, 44, 'DHIT27', 'Thực tập nghề nghiệp', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(39, 45, 'DHIT21', 'Thiết kế phần mềm ứng dụng Web', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(40, 46, 'DHIT22', 'Kiểm thử và bảo mật ứng dụng Web', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(41, 57, 'DHNC09', 'Thực hiện đề tài khoa học sinh viên', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(42, 58, 'DHTH01', 'Kỹ năng xây dựng và phát triển nhóm làm việc', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(43, 59, 'DHTL19', 'Kỹ năng tư duy', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(44, 60, 'DHIT30', 'Thực hành dự án phát triển phần mềm', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(45, 61, 'DHIT28', 'Hệ CSDL đa phương tiện', 20242, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(46, 62, 'DHIT29', 'Tương tác người - máy', 20242, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(47, 63, 'DHIT39', 'Lập trình mạng', 20242, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(55, 42, 'DHIT34', 'Đảm bảo chất lượng và kiểm thử phần mềm', 20251, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(56, 47, 'DHIT24', 'Phát triển phần mềm hướng dịch vụ', 20251, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(57, 49, 'DHIT35', 'Lập trình hệ thống nhúng', 20251, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(58, 50, 'DHIT23', 'Mạng không dây và di động', 20251, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(59, 51, 'DHIT36', 'Khai thác phần mềm ứng dụng', 20251, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(60, 52, 'DHIT38', 'Thực tập chuyên ngành', 20251, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(61, 53, 'DHIT20', 'Các vấn đề hiện đại của Công nghệ phần mềm', 20251, 1, 2, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(62, 64, 'DHIT42', 'An toàn mạng', 20251, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(63, 65, 'DHIT41', 'Đánh giá hiệu năng mạng', 20251, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(64, 66, 'DHIT40', 'Quản trị mạng', 20251, 1, 22, 'Đã kết thúc', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(75, 48, 'DHIT44', 'Thực tập tốt nghiệp', 20252, 1, 2, 'Đang học', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-09 21:53:29', NULL),
(76, 54, 'DHIT47', 'Ứng dụng cơ sở dữ liệu trên nền web', 20252, 1, 22, 'Đang học', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-16 10:00:00', NULL),
(77, 55, 'DHIT46', 'Quản trị dự án phần mềm', 20252, 1, 22, 'Đang học', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-16 10:00:00', NULL),
(78, 67, 'DHIT45', 'Khóa luận tốt nghiệp', 20252, 1, 2, 'Đang học', NULL, NULL, NULL, NULL, '2026-05-09 07:44:29', '2026-05-16 10:00:00', NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `class_members`
--

CREATE TABLE `class_members` (
  `id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `enroll_date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `class_members`
--

INSERT INTO `class_members` (`id`, `class_id`, `student_id`, `enroll_date`) VALUES
(1, 3, 3, '2026-05-09 08:30:42'),
(2, 12, 3, '2026-05-09 08:30:42'),
(3, 1, 3, '2026-05-09 08:30:42'),
(4, 5, 3, '2026-05-09 08:30:42'),
(5, 6, 3, '2026-05-09 08:30:42'),
(6, 7, 3, '2026-05-09 08:30:42'),
(7, 8, 3, '2026-05-09 08:30:42'),
(8, 9, 3, '2026-05-09 08:30:42'),
(9, 14, 3, '2026-05-09 08:30:42'),
(10, 15, 3, '2026-05-09 08:30:42'),
(11, 17, 3, '2026-05-09 08:30:42'),
(12, 10, 3, '2026-05-09 08:30:42'),
(13, 18, 3, '2026-05-09 08:30:42'),
(14, 16, 3, '2026-05-09 08:30:42'),
(15, 19, 3, '2026-05-09 08:30:42'),
(16, 20, 3, '2026-05-09 08:30:42'),
(17, 21, 3, '2026-05-09 08:30:42'),
(18, 22, 3, '2026-05-09 08:30:42'),
(19, 23, 3, '2026-05-09 08:30:42'),
(20, 24, 3, '2026-05-09 08:30:42'),
(21, 25, 3, '2026-05-09 08:30:42'),
(22, 26, 3, '2026-05-09 08:30:42'),
(23, 27, 3, '2026-05-09 08:30:42'),
(24, 28, 3, '2026-05-09 08:30:42'),
(25, 29, 3, '2026-05-09 08:30:42'),
(26, 30, 3, '2026-05-09 08:30:42'),
(27, 31, 3, '2026-05-09 08:30:42'),
(28, 32, 3, '2026-05-09 08:30:42'),
(29, 33, 3, '2026-05-09 08:30:42'),
(30, 36, 3, '2026-05-09 08:30:42'),
(31, 55, 3, '2026-05-09 08:30:42'),
(32, 38, 3, '2026-05-09 08:30:42'),
(33, 39, 3, '2026-05-09 08:30:42'),
(34, 40, 3, '2026-05-09 08:30:42'),
(35, 56, 3, '2026-05-09 08:30:42'),
(36, 75, 3, '2026-05-09 08:30:42'),
(37, 57, 3, '2026-05-09 08:30:42'),
(38, 59, 3, '2026-05-09 08:30:42'),
(39, 60, 3, '2026-05-09 08:30:42'),
(40, 61, 3, '2026-05-09 08:30:42'),
(41, 11, 3, '2026-05-09 08:30:42'),
(42, 3, 12, '2026-05-09 08:30:42'),
(43, 12, 12, '2026-05-09 08:30:42'),
(44, 1, 12, '2026-05-09 08:30:42'),
(45, 13, 12, '2026-05-09 08:30:42'),
(46, 5, 12, '2026-05-09 08:30:42'),
(47, 6, 12, '2026-05-09 08:30:42'),
(48, 7, 12, '2026-05-09 08:30:42'),
(49, 8, 12, '2026-05-09 08:30:42'),
(50, 9, 12, '2026-05-09 08:30:42'),
(51, 14, 12, '2026-05-09 08:30:42'),
(52, 15, 12, '2026-05-09 08:30:42'),
(53, 17, 12, '2026-05-09 08:30:42'),
(54, 10, 12, '2026-05-09 08:30:42'),
(55, 18, 12, '2026-05-09 08:30:42'),
(56, 16, 12, '2026-05-09 08:30:42'),
(57, 19, 12, '2026-05-09 08:30:42'),
(58, 20, 12, '2026-05-09 08:30:42'),
(59, 21, 12, '2026-05-09 08:30:42'),
(60, 22, 12, '2026-05-09 08:30:42'),
(61, 23, 12, '2026-05-09 08:30:42'),
(62, 24, 12, '2026-05-09 08:30:42'),
(63, 25, 12, '2026-05-09 08:30:42'),
(64, 26, 12, '2026-05-09 08:30:42'),
(65, 27, 12, '2026-05-09 08:30:42'),
(66, 28, 12, '2026-05-09 08:30:42'),
(67, 29, 12, '2026-05-09 08:30:42'),
(68, 30, 12, '2026-05-09 08:30:42'),
(69, 31, 12, '2026-05-09 08:30:42'),
(70, 32, 12, '2026-05-09 08:30:42'),
(71, 33, 12, '2026-05-09 08:30:42'),
(72, 36, 12, '2026-05-09 08:30:42'),
(73, 38, 12, '2026-05-09 08:30:42'),
(74, 56, 12, '2026-05-09 08:30:42'),
(75, 75, 12, '2026-05-09 08:30:42'),
(76, 58, 12, '2026-05-09 08:30:42'),
(77, 60, 12, '2026-05-09 08:30:42'),
(78, 11, 12, '2026-05-09 08:30:42'),
(79, 47, 12, '2026-05-09 08:30:42'),
(80, 62, 12, '2026-05-09 08:30:42'),
(81, 63, 12, '2026-05-09 08:30:42'),
(82, 64, 12, '2026-05-09 08:30:42'),
(83, 3, 8, '2026-05-09 08:30:42'),
(84, 12, 8, '2026-05-09 08:30:42'),
(85, 1, 8, '2026-05-09 08:30:42'),
(86, 5, 8, '2026-05-09 08:30:42'),
(87, 6, 8, '2026-05-09 08:30:42'),
(88, 7, 8, '2026-05-09 08:30:42'),
(89, 8, 8, '2026-05-09 08:30:42'),
(90, 9, 8, '2026-05-09 08:30:42'),
(91, 14, 8, '2026-05-09 08:30:42'),
(92, 15, 8, '2026-05-09 08:30:42'),
(93, 17, 8, '2026-05-09 08:30:42'),
(94, 10, 8, '2026-05-09 08:30:42'),
(95, 18, 8, '2026-05-09 08:30:42'),
(96, 16, 8, '2026-05-09 08:30:42'),
(97, 19, 8, '2026-05-09 08:30:42'),
(98, 20, 8, '2026-05-09 08:30:42'),
(99, 21, 8, '2026-05-09 08:30:42'),
(100, 22, 8, '2026-05-09 08:30:42'),
(101, 23, 8, '2026-05-09 08:30:42'),
(102, 24, 8, '2026-05-09 08:30:42'),
(103, 25, 8, '2026-05-09 08:30:42'),
(104, 26, 8, '2026-05-09 08:30:42'),
(105, 27, 8, '2026-05-09 08:30:42'),
(106, 28, 8, '2026-05-09 08:30:42'),
(107, 29, 8, '2026-05-09 08:30:42'),
(108, 30, 8, '2026-05-09 08:30:42'),
(109, 31, 8, '2026-05-09 08:30:42'),
(110, 32, 8, '2026-05-09 08:30:42'),
(111, 33, 8, '2026-05-09 08:30:42'),
(112, 34, 8, '2026-05-09 08:30:42'),
(113, 36, 8, '2026-05-09 08:30:42'),
(114, 38, 8, '2026-05-09 08:30:42'),
(115, 56, 8, '2026-05-09 08:30:42'),
(116, 75, 8, '2026-05-09 08:30:42'),
(117, 60, 8, '2026-05-09 08:30:42'),
(118, 11, 8, '2026-05-09 08:30:42'),
(119, 46, 8, '2026-05-09 08:30:42'),
(120, 3, 14, '2026-05-09 08:30:42'),
(121, 12, 14, '2026-05-09 08:30:42'),
(122, 1, 14, '2026-05-09 08:30:42'),
(123, 5, 14, '2026-05-09 08:30:42'),
(124, 6, 14, '2026-05-09 08:30:42'),
(125, 7, 14, '2026-05-09 08:30:42'),
(126, 8, 14, '2026-05-09 08:30:42'),
(127, 9, 14, '2026-05-09 08:30:42'),
(128, 14, 14, '2026-05-09 08:30:42'),
(129, 15, 14, '2026-05-09 08:30:42'),
(130, 17, 14, '2026-05-09 08:30:42'),
(131, 10, 14, '2026-05-09 08:30:42'),
(132, 18, 14, '2026-05-09 08:30:42'),
(133, 16, 14, '2026-05-09 08:30:42'),
(134, 19, 14, '2026-05-09 08:30:42'),
(135, 20, 14, '2026-05-09 08:30:42'),
(136, 21, 14, '2026-05-09 08:30:42'),
(137, 22, 14, '2026-05-09 08:30:42'),
(138, 23, 14, '2026-05-09 08:30:42'),
(139, 24, 14, '2026-05-09 08:30:42'),
(140, 25, 14, '2026-05-09 08:30:42'),
(141, 26, 14, '2026-05-09 08:30:42'),
(142, 27, 14, '2026-05-09 08:30:42'),
(143, 28, 14, '2026-05-09 08:30:42'),
(144, 29, 14, '2026-05-09 08:30:42'),
(145, 30, 14, '2026-05-09 08:30:42'),
(146, 31, 14, '2026-05-09 08:30:42'),
(147, 32, 14, '2026-05-09 08:30:42'),
(148, 33, 14, '2026-05-09 08:30:42'),
(149, 34, 14, '2026-05-09 08:30:42'),
(150, 36, 14, '2026-05-09 08:30:42'),
(151, 38, 14, '2026-05-09 08:30:42'),
(152, 56, 14, '2026-05-09 08:30:42'),
(153, 75, 14, '2026-05-09 08:30:42'),
(154, 60, 14, '2026-05-09 08:30:42'),
(155, 11, 14, '2026-05-09 08:30:42'),
(156, 46, 14, '2026-05-09 08:30:42'),
(157, 3, 16, '2026-05-09 08:30:42'),
(158, 12, 16, '2026-05-09 08:30:42'),
(159, 1, 16, '2026-05-09 08:30:42'),
(160, 5, 16, '2026-05-09 08:30:42'),
(161, 6, 16, '2026-05-09 08:30:42'),
(162, 7, 16, '2026-05-09 08:30:42'),
(163, 8, 16, '2026-05-09 08:30:42'),
(164, 9, 16, '2026-05-09 08:30:42'),
(165, 14, 16, '2026-05-09 08:30:42'),
(166, 15, 16, '2026-05-09 08:30:42'),
(167, 17, 16, '2026-05-09 08:30:42'),
(168, 10, 16, '2026-05-09 08:30:42'),
(169, 18, 16, '2026-05-09 08:30:42'),
(170, 16, 16, '2026-05-09 08:30:42'),
(171, 19, 16, '2026-05-09 08:30:42'),
(172, 20, 16, '2026-05-09 08:30:42'),
(173, 21, 16, '2026-05-09 08:30:42'),
(174, 22, 16, '2026-05-09 08:30:42'),
(175, 23, 16, '2026-05-09 08:30:42'),
(176, 24, 16, '2026-05-09 08:30:42'),
(177, 25, 16, '2026-05-09 08:30:42'),
(178, 26, 16, '2026-05-09 08:30:42'),
(179, 27, 16, '2026-05-09 08:30:42'),
(180, 28, 16, '2026-05-09 08:30:42'),
(181, 29, 16, '2026-05-09 08:30:42'),
(182, 30, 16, '2026-05-09 08:30:42'),
(183, 31, 16, '2026-05-09 08:30:42'),
(184, 32, 16, '2026-05-09 08:30:42'),
(185, 33, 16, '2026-05-09 08:30:42'),
(186, 36, 16, '2026-05-09 08:30:42'),
(187, 55, 16, '2026-05-09 08:30:42'),
(188, 38, 16, '2026-05-09 08:30:42'),
(189, 39, 16, '2026-05-09 08:30:42'),
(190, 40, 16, '2026-05-09 08:30:42'),
(191, 56, 16, '2026-05-09 08:30:42'),
(192, 75, 16, '2026-05-09 08:30:42'),
(193, 57, 16, '2026-05-09 08:30:42'),
(194, 59, 16, '2026-05-09 08:30:42'),
(195, 60, 16, '2026-05-09 08:30:42'),
(196, 61, 16, '2026-05-09 08:30:42'),
(197, 11, 16, '2026-05-09 08:30:42'),
(198, 3, 15, '2026-05-09 08:30:42'),
(199, 12, 15, '2026-05-09 08:30:42'),
(200, 1, 15, '2026-05-09 08:30:42'),
(201, 5, 15, '2026-05-09 08:30:42'),
(202, 6, 15, '2026-05-09 08:30:42'),
(203, 7, 15, '2026-05-09 08:30:42'),
(204, 8, 15, '2026-05-09 08:30:42'),
(205, 9, 15, '2026-05-09 08:30:42'),
(206, 14, 15, '2026-05-09 08:30:42'),
(207, 15, 15, '2026-05-09 08:30:42'),
(208, 17, 15, '2026-05-09 08:30:42'),
(209, 10, 15, '2026-05-09 08:30:42'),
(210, 18, 15, '2026-05-09 08:30:42'),
(211, 16, 15, '2026-05-09 08:30:42'),
(212, 19, 15, '2026-05-09 08:30:42'),
(213, 20, 15, '2026-05-09 08:30:42'),
(214, 21, 15, '2026-05-09 08:30:42'),
(215, 22, 15, '2026-05-09 08:30:42'),
(216, 23, 15, '2026-05-09 08:30:42'),
(217, 24, 15, '2026-05-09 08:30:42'),
(218, 25, 15, '2026-05-09 08:30:42'),
(219, 26, 15, '2026-05-09 08:30:42'),
(220, 27, 15, '2026-05-09 08:30:42'),
(221, 28, 15, '2026-05-09 08:30:42'),
(222, 29, 15, '2026-05-09 08:30:42'),
(223, 30, 15, '2026-05-09 08:30:42'),
(224, 31, 15, '2026-05-09 08:30:42'),
(225, 32, 15, '2026-05-09 08:30:42'),
(226, 33, 15, '2026-05-09 08:30:42'),
(227, 34, 15, '2026-05-09 08:30:42'),
(228, 36, 15, '2026-05-09 08:30:42'),
(229, 38, 15, '2026-05-09 08:30:42'),
(230, 56, 15, '2026-05-09 08:30:42'),
(231, 75, 15, '2026-05-09 08:30:42'),
(232, 60, 15, '2026-05-09 08:30:42'),
(233, 11, 15, '2026-05-09 08:30:42'),
(234, 46, 15, '2026-05-09 08:30:42'),
(256, 42, 3, '2026-05-09 08:36:32'),
(257, 42, 8, '2026-05-09 08:36:32'),
(258, 42, 15, '2026-05-09 08:36:32'),
(259, 41, 3, '2026-05-09 08:36:32'),
(260, 41, 12, '2026-05-09 08:36:32'),
(261, 41, 16, '2026-05-09 08:36:32'),
(262, 43, 3, '2026-05-09 08:36:32'),
(263, 43, 14, '2026-05-09 08:36:32'),
(264, 43, 16, '2026-05-09 08:36:32'),
(265, 37, 8, '2026-05-09 08:36:32'),
(266, 37, 14, '2026-05-09 08:36:32'),
(267, 37, 16, '2026-05-09 08:36:32'),
(268, 35, 12, '2026-05-09 08:36:32'),
(269, 35, 14, '2026-05-09 08:36:32'),
(270, 45, 8, '2026-05-09 08:36:32'),
(271, 45, 15, '2026-05-09 08:36:32'),
(272, 44, 12, '2026-05-09 08:36:32'),
(273, 44, 15, '2026-05-09 08:36:32'),
(302, 78, 3, '2026-05-09 08:44:04'),
(303, 78, 14, '2026-05-09 08:44:04'),
(304, 78, 16, '2026-05-09 08:44:04'),
(305, 76, 8, '2026-05-09 08:44:04'),
(306, 77, 8, '2026-05-09 08:44:04'),
(307, 76, 12, '2026-05-09 08:44:04'),
(308, 77, 12, '2026-05-09 08:44:04'),
(309, 76, 15, '2026-05-09 08:44:04'),
(310, 77, 15, '2026-05-09 08:44:04');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `class_results`
--

CREATE TABLE `class_results` (
  `id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `score_process` decimal(4,2) DEFAULT NULL,
  `score_midterm` decimal(4,2) DEFAULT NULL,
  `score_final` decimal(4,2) DEFAULT NULL,
  `total_score` decimal(3,1) DEFAULT NULL,
  `score_retake` decimal(4,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `class_results`
--

INSERT INTO `class_results` (`id`, `account_id`, `class_id`, `score_process`, `score_midterm`, `score_final`, `total_score`, `score_retake`) VALUES
(66, 3, 3, 9.30, 8.50, 7.90, 8.2, NULL),
(67, 3, 12, 8.60, 7.20, 7.80, 7.7, NULL),
(68, 3, 1, 9.00, 8.70, 7.90, 8.3, NULL),
(69, 3, 5, 9.80, 7.50, 8.10, 8.1, NULL),
(70, 3, 6, 9.30, 7.70, 9.00, 8.6, NULL),
(71, 3, 7, 8.70, 7.80, 7.30, 7.6, NULL),
(72, 3, 8, 9.60, 7.80, 7.90, 8.0, NULL),
(73, 3, 9, 9.80, 7.90, 7.20, 7.7, NULL),
(74, 3, 14, 8.90, 7.70, 8.10, 8.1, NULL),
(75, 3, 15, 9.00, 8.10, 7.20, 7.7, NULL),
(76, 3, 17, 8.80, 8.90, 7.60, 8.1, NULL),
(77, 3, 10, 9.90, 9.40, 9.50, 9.5, NULL),
(78, 3, 18, 8.60, 7.60, 7.20, 7.5, NULL),
(79, 3, 16, 9.50, 7.10, 7.60, 7.6, NULL),
(80, 3, 19, 8.50, 8.10, 7.50, 7.8, NULL),
(81, 3, 20, 9.40, 8.20, 8.20, 8.3, NULL),
(82, 3, 21, 8.60, 9.00, 9.20, 9.1, NULL),
(83, 3, 22, 9.90, 7.00, 7.70, 7.7, NULL),
(84, 3, 23, 8.90, 8.60, 8.10, 8.3, NULL),
(85, 3, 24, 8.80, 8.60, 8.60, 8.6, NULL),
(86, 3, 25, 9.00, 8.80, 8.40, 8.6, NULL),
(87, 3, 26, 9.50, 8.70, 8.10, 8.4, NULL),
(88, 3, 27, 8.60, 9.50, 8.90, 9.1, NULL),
(89, 3, 28, 9.90, 7.60, 8.30, 8.3, NULL),
(90, 3, 29, 9.80, 8.70, 9.00, 9.0, NULL),
(91, 3, 30, 9.90, 7.60, 8.10, 8.1, NULL),
(92, 3, 31, 9.30, 8.10, 8.40, 8.4, NULL),
(93, 3, 32, 9.00, 7.50, 9.10, 8.6, NULL),
(94, 3, 33, 9.50, 8.70, 8.20, 8.5, NULL),
(95, 3, 36, 9.00, 7.40, 9.30, 8.7, NULL),
(96, 3, 55, 8.60, 8.10, 7.30, 7.7, NULL),
(97, 3, 38, 9.00, 7.30, 8.90, 8.4, NULL),
(98, 3, 39, 9.10, 8.60, 9.50, 9.2, NULL),
(99, 3, 40, 8.60, 7.60, 7.40, 7.6, NULL),
(100, 3, 56, 8.50, 8.50, 9.40, 9.0, NULL),
(101, 3, 57, 8.50, 7.70, 7.50, 7.7, NULL),
(102, 3, 59, 8.80, 8.40, 7.20, 7.7, NULL),
(103, 3, 60, 9.60, 8.20, 7.60, 8.0, NULL),
(104, 3, 61, 9.60, 9.00, 9.30, 9.2, NULL),
(105, 3, 11, 8.70, 9.30, 7.50, 8.2, NULL),
(106, 3, 42, 9.00, 9.40, 8.90, 9.1, NULL),
(107, 3, 41, 8.50, 8.80, 8.40, 8.5, NULL),
(108, 3, 43, 9.60, 9.40, 8.30, 8.8, NULL),
(129, 3, 75, 10.00, 8.00, 8.50, 8.5, NULL),
(130, 8, 75, 10.00, 8.00, 8.50, 8.5, NULL),
(131, 12, 75, 9.00, 8.00, 8.00, 8.1, NULL),
(132, 14, 75, 9.50, 8.00, 8.50, 8.5, NULL),
(133, 15, 75, 9.50, 8.00, 9.00, 8.8, NULL),
(134, 16, 75, 9.00, 8.00, 8.00, 8.1, NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `class_sessions`
--

CREATE TABLE `class_sessions` (
  `id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `session_number` int(11) NOT NULL,
  `date` date NOT NULL,
  `period` varchar(20) NOT NULL,
  `mode` enum('Trực tuyến','Trực tiếp') DEFAULT 'Trực tiếp',
  `content` text DEFAULT NULL,
  `material_link` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `class_sessions`
--

INSERT INTO `class_sessions` (`id`, `class_id`, `session_number`, `date`, `period`, `mode`, `content`, `material_link`) VALUES
(40, 3, 1, '2023-08-07', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(41, 17, 1, '2023-08-08', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(42, 18, 1, '2023-08-09', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(43, 19, 1, '2023-08-10', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(44, 3, 2, '2023-08-14', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(45, 17, 2, '2023-08-15', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(46, 18, 2, '2023-08-16', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(47, 19, 2, '2023-08-17', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(48, 3, 3, '2023-08-21', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(49, 17, 3, '2023-08-22', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(50, 18, 3, '2023-08-23', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(51, 19, 3, '2023-08-24', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(52, 3, 4, '2023-08-28', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(53, 17, 4, '2023-08-29', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(54, 18, 4, '2023-08-30', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(55, 19, 4, '2023-08-31', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(56, 3, 5, '2023-09-04', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(57, 17, 5, '2023-09-05', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(58, 18, 5, '2023-09-06', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(59, 19, 5, '2023-09-07', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(60, 3, 6, '2023-09-11', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(61, 17, 6, '2023-09-12', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(62, 18, 6, '2023-09-13', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(63, 19, 6, '2023-09-14', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(64, 3, 7, '2023-09-18', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(65, 17, 7, '2023-09-19', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(66, 18, 7, '2023-09-20', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(67, 19, 7, '2023-09-21', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(68, 3, 8, '2023-09-25', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(69, 17, 8, '2023-09-26', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(70, 18, 8, '2023-09-27', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(71, 19, 8, '2023-09-28', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(103, 5, 1, '2022-08-01', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(104, 6, 1, '2022-08-01', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(105, 7, 1, '2022-08-02', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(106, 8, 1, '2022-08-02', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(107, 9, 1, '2022-08-03', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(108, 10, 1, '2022-08-03', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(109, 11, 1, '2022-08-04', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(110, 5, 2, '2022-08-08', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(111, 6, 2, '2022-08-08', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(112, 7, 2, '2022-08-09', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(113, 8, 2, '2022-08-09', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(114, 9, 2, '2022-08-10', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(115, 10, 2, '2022-08-10', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(116, 11, 2, '2022-08-11', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(117, 5, 3, '2022-08-15', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(118, 6, 3, '2022-08-15', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(119, 7, 3, '2022-08-16', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(120, 8, 3, '2022-08-16', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(121, 9, 3, '2022-08-17', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(122, 10, 3, '2022-08-17', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(123, 11, 3, '2022-08-18', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(124, 5, 4, '2022-08-22', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(125, 6, 4, '2022-08-22', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(126, 7, 4, '2022-08-23', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(127, 8, 4, '2022-08-23', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(128, 9, 4, '2022-08-24', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(129, 10, 4, '2022-08-24', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(130, 11, 4, '2022-08-25', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(131, 5, 5, '2022-08-29', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(132, 6, 5, '2022-08-29', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(133, 7, 5, '2022-08-30', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(134, 8, 5, '2022-08-30', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(135, 9, 5, '2022-08-31', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(136, 10, 5, '2022-08-31', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(137, 11, 5, '2022-09-01', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(138, 5, 6, '2022-09-05', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(139, 6, 6, '2022-09-05', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(140, 7, 6, '2022-09-06', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(141, 8, 6, '2022-09-06', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(142, 9, 6, '2022-09-07', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(143, 10, 6, '2022-09-07', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(144, 11, 6, '2022-09-08', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(145, 5, 7, '2022-09-12', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(146, 6, 7, '2022-09-12', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(147, 7, 7, '2022-09-13', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(148, 8, 7, '2022-09-13', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(149, 9, 7, '2022-09-14', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(150, 10, 7, '2022-09-14', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(151, 11, 7, '2022-09-15', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(152, 5, 8, '2022-09-19', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(153, 6, 8, '2022-09-19', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(154, 7, 8, '2022-09-20', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(155, 8, 8, '2022-09-20', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(156, 9, 8, '2022-09-21', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(157, 10, 8, '2022-09-21', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(158, 11, 8, '2022-09-22', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(166, 1, 1, '2023-01-02', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(167, 12, 1, '2023-01-02', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(168, 13, 1, '2023-01-03', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(169, 14, 1, '2023-01-03', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(170, 15, 1, '2023-01-04', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(171, 16, 1, '2023-01-04', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(172, 1, 2, '2023-01-09', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(173, 12, 2, '2023-01-09', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(174, 13, 2, '2023-01-10', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(175, 14, 2, '2023-01-10', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(176, 15, 2, '2023-01-11', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(177, 16, 2, '2023-01-11', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(178, 1, 3, '2023-01-16', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(179, 12, 3, '2023-01-16', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(180, 13, 3, '2023-01-17', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(181, 14, 3, '2023-01-17', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(182, 15, 3, '2023-01-18', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(183, 16, 3, '2023-01-18', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(184, 1, 4, '2023-01-23', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(185, 12, 4, '2023-01-23', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(186, 13, 4, '2023-01-24', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(187, 14, 4, '2023-01-24', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(188, 15, 4, '2023-01-25', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(189, 16, 4, '2023-01-25', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(190, 1, 5, '2023-01-30', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(191, 12, 5, '2023-01-30', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(192, 13, 5, '2023-01-31', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(193, 14, 5, '2023-01-31', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(194, 15, 5, '2023-02-01', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(195, 16, 5, '2023-02-01', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(196, 1, 6, '2023-02-06', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(197, 12, 6, '2023-02-06', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(198, 13, 6, '2023-02-07', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(199, 14, 6, '2023-02-07', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(200, 15, 6, '2023-02-08', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(201, 16, 6, '2023-02-08', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(202, 1, 7, '2023-02-13', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(203, 12, 7, '2023-02-13', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(204, 13, 7, '2023-02-14', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(205, 14, 7, '2023-02-14', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(206, 15, 7, '2023-02-15', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(207, 16, 7, '2023-02-15', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(208, 1, 8, '2023-02-20', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(209, 12, 8, '2023-02-20', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(210, 13, 8, '2023-02-21', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(211, 14, 8, '2023-02-21', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(212, 15, 8, '2023-02-22', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(213, 16, 8, '2023-02-22', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(229, 20, 1, '2024-01-01', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(230, 21, 1, '2024-01-01', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(231, 22, 1, '2024-01-02', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(232, 23, 1, '2024-01-02', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(233, 24, 1, '2024-01-03', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(234, 25, 1, '2024-01-03', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(235, 26, 1, '2024-01-04', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(236, 27, 1, '2024-01-04', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(237, 20, 2, '2024-01-08', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(238, 21, 2, '2024-01-08', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(239, 22, 2, '2024-01-09', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(240, 23, 2, '2024-01-09', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(241, 24, 2, '2024-01-10', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(242, 25, 2, '2024-01-10', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(243, 26, 2, '2024-01-11', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(244, 27, 2, '2024-01-11', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(245, 20, 3, '2024-01-15', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(246, 21, 3, '2024-01-15', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(247, 22, 3, '2024-01-16', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(248, 23, 3, '2024-01-16', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(249, 24, 3, '2024-01-17', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(250, 25, 3, '2024-01-17', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(251, 26, 3, '2024-01-18', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(252, 27, 3, '2024-01-18', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(253, 20, 4, '2024-01-22', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(254, 21, 4, '2024-01-22', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(255, 22, 4, '2024-01-23', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(256, 23, 4, '2024-01-23', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(257, 24, 4, '2024-01-24', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(258, 25, 4, '2024-01-24', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(259, 26, 4, '2024-01-25', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(260, 27, 4, '2024-01-25', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(261, 20, 5, '2024-01-29', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(262, 21, 5, '2024-01-29', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(263, 22, 5, '2024-01-30', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(264, 23, 5, '2024-01-30', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(265, 24, 5, '2024-01-31', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(266, 25, 5, '2024-01-31', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(267, 26, 5, '2024-02-01', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(268, 27, 5, '2024-02-01', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(269, 20, 6, '2024-02-05', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(270, 21, 6, '2024-02-05', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(271, 22, 6, '2024-02-06', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(272, 23, 6, '2024-02-06', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(273, 24, 6, '2024-02-07', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(274, 25, 6, '2024-02-07', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(275, 26, 6, '2024-02-08', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(276, 27, 6, '2024-02-08', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(277, 20, 7, '2024-02-12', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(278, 21, 7, '2024-02-12', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(279, 22, 7, '2024-02-13', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(280, 23, 7, '2024-02-13', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(281, 24, 7, '2024-02-14', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(282, 25, 7, '2024-02-14', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(283, 26, 7, '2024-02-15', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(284, 27, 7, '2024-02-15', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(285, 20, 8, '2024-02-19', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(286, 21, 8, '2024-02-19', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(287, 22, 8, '2024-02-20', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(288, 23, 8, '2024-02-20', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(289, 24, 8, '2024-02-21', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(290, 25, 8, '2024-02-21', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(291, 26, 8, '2024-02-22', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(292, 27, 8, '2024-02-22', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(356, 28, 1, '2024-08-05', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(357, 29, 1, '2024-08-05', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(358, 30, 1, '2024-08-06', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(359, 31, 1, '2024-08-06', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(360, 32, 1, '2024-08-07', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(361, 33, 1, '2024-08-07', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(362, 28, 2, '2024-08-12', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(363, 29, 2, '2024-08-12', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(364, 30, 2, '2024-08-13', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(365, 31, 2, '2024-08-13', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(366, 32, 2, '2024-08-14', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(367, 33, 2, '2024-08-14', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(368, 28, 3, '2024-08-19', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(369, 29, 3, '2024-08-19', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(370, 30, 3, '2024-08-20', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(371, 31, 3, '2024-08-20', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(372, 32, 3, '2024-08-21', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(373, 33, 3, '2024-08-21', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(374, 28, 4, '2024-08-26', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(375, 29, 4, '2024-08-26', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(376, 30, 4, '2024-08-27', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(377, 31, 4, '2024-08-27', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(378, 32, 4, '2024-08-28', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(379, 33, 4, '2024-08-28', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(380, 28, 5, '2024-09-02', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(381, 29, 5, '2024-09-02', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(382, 30, 5, '2024-09-03', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(383, 31, 5, '2024-09-03', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(384, 32, 5, '2024-09-04', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(385, 33, 5, '2024-09-04', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(386, 28, 6, '2024-09-09', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(387, 29, 6, '2024-09-09', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(388, 30, 6, '2024-09-10', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(389, 31, 6, '2024-09-10', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(390, 32, 6, '2024-09-11', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(391, 33, 6, '2024-09-11', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(392, 28, 7, '2024-09-16', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(393, 29, 7, '2024-09-16', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(394, 30, 7, '2024-09-17', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(395, 31, 7, '2024-09-17', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(396, 32, 7, '2024-09-18', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(397, 33, 7, '2024-09-18', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(398, 28, 8, '2024-09-23', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(399, 29, 8, '2024-09-23', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(400, 30, 8, '2024-09-24', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(401, 31, 8, '2024-09-24', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(402, 32, 8, '2024-09-25', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(403, 33, 8, '2024-09-25', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(419, 34, 1, '2025-01-06', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(420, 34, 2, '2025-01-13', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(421, 34, 3, '2025-01-20', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(422, 34, 4, '2025-01-27', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(423, 34, 5, '2025-02-03', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(424, 34, 6, '2025-02-10', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(425, 34, 7, '2025-02-17', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(426, 34, 8, '2025-02-24', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(427, 35, 1, '2025-01-06', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(428, 35, 2, '2025-01-13', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(429, 35, 3, '2025-01-20', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(430, 35, 4, '2025-01-27', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(431, 35, 5, '2025-02-03', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(432, 35, 6, '2025-02-10', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(433, 35, 7, '2025-02-17', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(434, 35, 8, '2025-02-24', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(435, 36, 1, '2025-01-06', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(436, 36, 2, '2025-01-13', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(437, 36, 3, '2025-01-20', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(438, 36, 4, '2025-01-27', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(439, 36, 5, '2025-02-03', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(440, 36, 6, '2025-02-10', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(441, 36, 7, '2025-02-17', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(442, 36, 8, '2025-02-24', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(443, 37, 1, '2025-01-07', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(444, 37, 2, '2025-01-14', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(445, 37, 3, '2025-01-21', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(446, 37, 4, '2025-01-28', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(447, 37, 5, '2025-02-04', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(448, 37, 6, '2025-02-11', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(449, 37, 7, '2025-02-18', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(450, 37, 8, '2025-02-25', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(459, 39, 1, '2025-01-07', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(460, 39, 2, '2025-01-14', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(461, 39, 3, '2025-01-21', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(462, 39, 4, '2025-01-28', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(463, 39, 5, '2025-02-04', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(464, 39, 6, '2025-02-11', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(465, 39, 7, '2025-02-18', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(466, 39, 8, '2025-02-25', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(467, 40, 1, '2025-01-08', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(468, 40, 2, '2025-01-15', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(469, 40, 3, '2025-01-22', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(470, 40, 4, '2025-01-29', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(471, 40, 5, '2025-02-05', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(472, 40, 6, '2025-02-12', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(473, 40, 7, '2025-02-19', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(474, 40, 8, '2025-02-26', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(475, 41, 1, '2025-01-08', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(476, 41, 2, '2025-01-15', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(477, 41, 3, '2025-01-22', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(478, 41, 4, '2025-01-29', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(479, 41, 5, '2025-02-05', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(480, 41, 6, '2025-02-12', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(481, 41, 7, '2025-02-19', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(482, 41, 8, '2025-02-26', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(483, 42, 1, '2025-01-08', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(484, 42, 2, '2025-01-15', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(485, 42, 3, '2025-01-22', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(486, 42, 4, '2025-01-29', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(487, 42, 5, '2025-02-05', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(488, 42, 6, '2025-02-12', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(489, 42, 7, '2025-02-19', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(490, 42, 8, '2025-02-26', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(491, 43, 1, '2025-01-09', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(492, 43, 2, '2025-01-16', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(493, 43, 3, '2025-01-23', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(494, 43, 4, '2025-01-30', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(495, 43, 5, '2025-02-06', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(496, 43, 6, '2025-02-13', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(497, 43, 7, '2025-02-20', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(498, 43, 8, '2025-02-27', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(499, 44, 1, '2025-01-09', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(500, 44, 2, '2025-01-16', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(501, 44, 3, '2025-01-23', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(502, 44, 4, '2025-01-30', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(503, 44, 5, '2025-02-06', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(504, 44, 6, '2025-02-13', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(505, 44, 7, '2025-02-20', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(506, 44, 8, '2025-02-27', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(507, 45, 1, '2025-01-09', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(508, 45, 2, '2025-01-16', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(509, 45, 3, '2025-01-23', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(510, 45, 4, '2025-01-30', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(511, 45, 5, '2025-02-06', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(512, 45, 6, '2025-02-13', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(513, 45, 7, '2025-02-20', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(514, 45, 8, '2025-02-27', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(515, 46, 1, '2025-01-10', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(516, 46, 2, '2025-01-17', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(517, 46, 3, '2025-01-24', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(518, 46, 4, '2025-01-31', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(519, 46, 5, '2025-02-07', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(520, 46, 6, '2025-02-14', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(521, 46, 7, '2025-02-21', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(522, 46, 8, '2025-02-28', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(523, 47, 1, '2025-01-10', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(524, 47, 2, '2025-01-17', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(525, 47, 3, '2025-01-24', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(526, 47, 4, '2025-01-31', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(527, 47, 5, '2025-02-07', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(528, 47, 6, '2025-02-14', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(529, 47, 7, '2025-02-21', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(530, 47, 8, '2025-02-28', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(546, 38, 1, '2025-03-03', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(547, 38, 2, '2025-03-10', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(548, 38, 3, '2025-03-17', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(549, 38, 4, '2025-03-24', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(550, 38, 5, '2025-03-31', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(551, 38, 6, '2025-04-07', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(552, 38, 7, '2025-04-14', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(553, 38, 8, '2025-04-21', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(561, 55, 1, '2025-08-04', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(562, 55, 2, '2025-08-11', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(563, 55, 3, '2025-08-18', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(564, 55, 4, '2025-08-25', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(565, 55, 5, '2025-09-01', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(566, 55, 6, '2025-09-08', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(567, 55, 7, '2025-09-15', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(568, 55, 8, '2025-09-22', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(569, 56, 1, '2025-08-04', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(570, 56, 2, '2025-08-11', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(571, 56, 3, '2025-08-18', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(572, 56, 4, '2025-08-25', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(573, 56, 5, '2025-09-01', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(574, 56, 6, '2025-09-08', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(575, 56, 7, '2025-09-15', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(576, 56, 8, '2025-09-22', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(577, 57, 1, '2025-08-05', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(578, 57, 2, '2025-08-12', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(579, 57, 3, '2025-08-19', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(580, 57, 4, '2025-08-26', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(581, 57, 5, '2025-09-02', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(582, 57, 6, '2025-09-09', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(583, 57, 7, '2025-09-16', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(584, 57, 8, '2025-09-23', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(585, 58, 1, '2025-08-05', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(586, 58, 2, '2025-08-12', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(587, 58, 3, '2025-08-19', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(588, 58, 4, '2025-08-26', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(589, 58, 5, '2025-09-02', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(590, 58, 6, '2025-09-09', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(591, 58, 7, '2025-09-16', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(592, 58, 8, '2025-09-23', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(593, 59, 1, '2025-08-06', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(594, 59, 2, '2025-08-13', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(595, 59, 3, '2025-08-20', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(596, 59, 4, '2025-08-27', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(597, 59, 5, '2025-09-03', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(598, 59, 6, '2025-09-10', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(599, 59, 7, '2025-09-17', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(600, 59, 8, '2025-09-24', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(601, 61, 1, '2025-08-06', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(602, 61, 2, '2025-08-13', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(603, 61, 3, '2025-08-20', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(604, 61, 4, '2025-08-27', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(605, 61, 5, '2025-09-03', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(606, 61, 6, '2025-09-10', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(607, 61, 7, '2025-09-17', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(608, 61, 8, '2025-09-24', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(609, 62, 1, '2025-08-07', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(610, 62, 2, '2025-08-14', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(611, 62, 3, '2025-08-21', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(612, 62, 4, '2025-08-28', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(613, 62, 5, '2025-09-04', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(614, 62, 6, '2025-09-11', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(615, 62, 7, '2025-09-18', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(616, 62, 8, '2025-09-25', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(617, 63, 1, '2025-08-07', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(618, 63, 2, '2025-08-14', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(619, 63, 3, '2025-08-21', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(620, 63, 4, '2025-08-28', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(621, 63, 5, '2025-09-04', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(622, 63, 6, '2025-09-11', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(623, 63, 7, '2025-09-18', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(624, 63, 8, '2025-09-25', 'Tiết 10-12', 'Trực tiếp', NULL, NULL),
(625, 64, 1, '2025-08-08', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(626, 64, 2, '2025-08-15', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(627, 64, 3, '2025-08-22', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(628, 64, 4, '2025-08-29', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(629, 64, 5, '2025-09-05', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(630, 64, 6, '2025-09-12', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(631, 64, 7, '2025-09-19', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(632, 64, 8, '2025-09-26', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(688, 60, 1, '2025-09-29', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(689, 60, 2, '2025-10-06', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(690, 60, 3, '2025-10-13', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(691, 60, 4, '2025-10-20', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(692, 60, 5, '2025-10-27', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(693, 60, 6, '2025-11-03', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(694, 60, 7, '2025-11-10', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(695, 60, 8, '2025-11-17', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(749, 75, 1, '2026-02-02', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(750, 75, 2, '2026-02-09', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(751, 75, 3, '2026-02-16', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(752, 75, 4, '2026-02-23', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(753, 75, 5, '2026-03-02', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(754, 75, 6, '2026-03-09', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(755, 75, 7, '2026-03-16', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(756, 75, 8, '2026-03-23', 'Tiết 1-6', 'Trực tiếp', NULL, NULL),
(795, 76, 1, '2026-03-30', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(796, 77, 1, '2026-03-30', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(797, 78, 1, '2026-03-30', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(798, 76, 2, '2026-04-06', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(799, 77, 2, '2026-04-06', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(800, 78, 2, '2026-04-06', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(801, 76, 3, '2026-04-13', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(802, 77, 3, '2026-04-13', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(803, 78, 3, '2026-04-13', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(804, 76, 4, '2026-04-20', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(805, 77, 4, '2026-04-20', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(806, 78, 4, '2026-04-20', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(807, 76, 5, '2026-04-27', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(808, 77, 5, '2026-04-27', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(809, 78, 5, '2026-04-27', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(810, 76, 6, '2026-05-04', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(811, 77, 6, '2026-05-04', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(812, 78, 6, '2026-05-04', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(813, 76, 7, '2026-05-11', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(814, 77, 7, '2026-05-11', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(815, 78, 7, '2026-05-11', 'Tiết 7-9', 'Trực tiếp', NULL, NULL),
(816, 76, 8, '2026-05-18', 'Tiết 1-3', 'Trực tiếp', NULL, NULL),
(817, 77, 8, '2026-05-18', 'Tiết 4-6', 'Trực tiếp', NULL, NULL),
(818, 78, 8, '2026-05-18', 'Tiết 7-9', 'Trực tiếp', NULL, NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `curriculum`
--

CREATE TABLE `curriculum` (
  `id` int(11) NOT NULL,
  `major_id` int(11) DEFAULT NULL,
  `years` int(11) DEFAULT NULL,
  `e_credits` int(11) DEFAULT NULL,
  `total_credits` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `curriculum`
--

INSERT INTO `curriculum` (`id`, `major_id`, `years`, `e_credits`, `total_credits`) VALUES
(1, 1, 2022, 6, 122),
(2, 1, 2024, 12, 130),
(3, 2, 2022, 10, 128);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `exam_participants`
--

CREATE TABLE `exam_participants` (
  `id` int(11) NOT NULL,
  `exam_session_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `seat_number` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `exam_sessions`
--

CREATE TABLE `exam_sessions` (
  `id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `exam_date` date NOT NULL,
  `exam_time` time NOT NULL,
  `room` varchar(50) NOT NULL,
  `date_start` datetime NOT NULL,
  `date_end` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `exam_sessions`
--

INSERT INTO `exam_sessions` (`id`, `class_id`, `exam_date`, `exam_time`, `room`, `date_start`, `date_end`) VALUES
(1, 1, '2023-05-08', '13:30:00', 'LAB4', '2023-06-01 00:00:00', '2023-06-15 00:00:00'),
(2, 3, '2023-05-08', '08:00:00', 'LAB3', '2023-06-01 00:00:00', '2023-06-15 00:00:00'),
(3, 1, '2026-05-08', '08:00:00', 'LAB4', '2023-06-01 00:00:00', '2023-06-15 00:00:00');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `faculties`
--

CREATE TABLE `faculties` (
  `id` int(11) NOT NULL,
  `faculty_code` int(7) NOT NULL,
  `faculty_name` varchar(50) NOT NULL,
  `date_start` date DEFAULT NULL,
  `date_end` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `faculties`
--

INSERT INTO `faculties` (`id`, `faculty_code`, `faculty_name`, `date_start`, `date_end`) VALUES
(1, 7480201, 'Công nghệ thông tin', NULL, NULL),
(2, 7220201, 'Ngôn ngữ Anh', NULL, NULL),
(3, 7340101, 'Quản trị kinh doanh', NULL, NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `forums`
--

CREATE TABLE `forums` (
  `id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `post_title` varchar(255) NOT NULL,
  `content` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `leave_requests`
--

CREATE TABLE `leave_requests` (
  `id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `date` date NOT NULL,
  `reason` text NOT NULL,
  `evidence` varchar(255) DEFAULT NULL,
  `status` enum('Chờ duyệt','Duyệt','Bị từ chối') DEFAULT 'Chờ duyệt',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `majors`
--

CREATE TABLE `majors` (
  `id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `major_code` varchar(10) NOT NULL,
  `major_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `majors`
--

INSERT INTO `majors` (`id`, `faculty_id`, `major_code`, `major_name`) VALUES
(0, 1, '7480102', 'Đại cương'),
(1, 1, '7480201_01', 'Công nghệ phần mềm'),
(2, 1, '7480201_02', 'Trí tuệ nhân tạo'),
(3, 1, '7480201_03', 'Quản trị hệ thống mạng');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `major_registrations`
--

CREATE TABLE `major_registrations` (
  `id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `major_id` int(11) NOT NULL,
  `note` text DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Chờ duyệt',
  `date_start` datetime DEFAULT NULL,
  `date_end` datetime DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `notifications`
--

CREATE TABLE `notifications` (
  `id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `profile`
--

CREATE TABLE `profile` (
  `id` int(4) NOT NULL,
  `account_id` int(4) NOT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `first_name` varchar(10) NOT NULL,
  `last_name` varchar(20) NOT NULL,
  `dob` date NOT NULL,
  `gender` enum('Nam','Nữ','Khác') NOT NULL,
  `email` varchar(30) DEFAULT NULL,
  `phone` varchar(10) DEFAULT NULL,
  `address` varchar(50) DEFAULT NULL,
  `year` varchar(10) DEFAULT NULL,
  `academic_year` varchar(15) DEFAULT NULL,
  `faculty_id` int(11) DEFAULT NULL,
  `major_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `profile`
--

INSERT INTO `profile` (`id`, `account_id`, `avatar`, `first_name`, `last_name`, `dob`, `gender`, `email`, `phone`, `address`, `year`, `academic_year`, `faculty_id`, `major_id`) VALUES
(1, 1, '', 'Viên', 'Nguyễn Văn', '1975-01-01', 'Nam', 'ngvanvien@gmail.com', '0987654321', 'Hà Nội', NULL, NULL, NULL, NULL),
(2, 2, '', 'Anh', 'Nguyễn Thị', '1980-02-22', 'Nữ', 'ntanh22@gmail.com', '0981236688', 'Hà Nội', 'K11CNTT', '2010', 1, 1),
(3, 3, '', 'Thảo', 'Hà Phương', '2004-11-14', 'Khác', 'hphgth@gmail.com', '0949536868', 'Hà Nội', 'K10CNTT', '2022', 1, 1),
(4, 12, NULL, 'Thùy', 'Đinh Thị', '2003-11-30', 'Nữ', 'dinhthuy@gmail.com', '0966888386', 'Hà Nội', 'K10CNTT', '2022', 1, 3),
(5, 8, NULL, 'Hiền', 'Nguyễn Thu', '2004-12-03', 'Nữ', 'nth0312@gmail.com', '0321466855', 'Hà Nội', 'K10CNTT', '2022', 1, 2),
(6, 14, '', 'Anh', 'Đinh Thị Thùy', '2005-02-02', 'Khác', NULL, NULL, 'Hà Nội', 'K10CNTT', '2022', 1, 2),
(19, 16, NULL, 'Văn', 'Nguyễn Trung', '2005-01-01', 'Nam', NULL, NULL, 'TP.HCM', 'K10CNTT', '2022', 1, 1),
(20, 15, NULL, 'Tùng', 'Hoàng Thanh', '2005-02-01', 'Nam', NULL, NULL, 'TP.HCM', 'K10CNTT', '2022', 1, 2),
(47, 20, '', 'Sứa', 'Lào Thị', '2005-12-07', 'Nữ', NULL, NULL, NULL, 'K11QTKD', NULL, 3, NULL),
(48, 21, '', 'Quang', 'Trịnh Đình', '2006-07-07', 'Nam', NULL, NULL, NULL, 'K12NNA', NULL, 2, NULL),
(49, 9, NULL, 'Trang', 'Trần Hoài', '1992-08-24', 'Nữ', 'trangth@gmail.com', '0987612345', NULL, 'K10NNA', '2010', 2, NULL),
(50, 22, '', 'Giang', 'Trương Văn', '1976-06-10', 'Nam', 'giangtrgV@gmail.com', '0949536768', NULL, 'K10CNTT', '2010', 1, 3);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `re_exam_requests`
--

CREATE TABLE `re_exam_requests` (
  `id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `subject_id` int(11) NOT NULL,
  `grade_id` int(11) NOT NULL,
  `exam_date` date DEFAULT NULL,
  `reason` text DEFAULT NULL,
  `status` enum('Chờ duyệt','Đang xử lý','Duyệt','Bị từ chối') DEFAULT 'Chờ duyệt',
  `date_start` datetime NOT NULL,
  `date_end` datetime NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `schedule`
--

CREATE TABLE `schedule` (
  `id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `day_of_week` int(11) DEFAULT NULL,
  `start_time` time DEFAULT NULL,
  `end_time` time DEFAULT NULL,
  `room` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `subjects`
--

CREATE TABLE `subjects` (
  `id` int(11) NOT NULL,
  `major_id` int(11) DEFAULT NULL,
  `subject_code` varchar(6) NOT NULL,
  `subject_name` varchar(255) NOT NULL,
  `credit` int(1) NOT NULL,
  `description` text DEFAULT NULL,
  `semester` int(11) DEFAULT 1,
  `is_e` enum('0','1','2') NOT NULL DEFAULT '0',
  `total_sessions` int(11) DEFAULT 15
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `subjects`
--

INSERT INTO `subjects` (`id`, `major_id`, `subject_code`, `subject_name`, `credit`, `description`, `semester`, `is_e`, `total_sessions`) VALUES
(1, 0, 'DHIT15', 'Ngôn ngữ HTML, CSS, JavaScript', 3, NULL, 3, '0', 8),
(2, 0, 'DHIT10', 'Nhập môn CSDL', 3, NULL, 2, '0', 8),
(3, 0, 'DHIT04', 'Lập trình C++', 3, NULL, 2, '0', 8),
(4, 3, 'DHIT11', 'Nhập môn mạng máy tính', 3, '', 2, '0', 8),
(8, 0, 'DHIT08', 'Kiến trúc máy tính', 3, NULL, 1, '0', 8),
(9, 0, 'DHIT33', 'Tin học đại cương', 3, NULL, 1, '0', 8),
(11, 0, 'DHIT49', 'Phương pháp nghiên cứu khoa học', 2, NULL, 1, '0', 8),
(12, 0, 'DHIT03', 'Đại số', 3, NULL, 1, '0', 8),
(13, 0, 'DHIT19', 'Lắp ráp, cài đặt bảo trì máy tính', 3, NULL, 1, '0', 8),
(14, 0, 'DHCT13', 'Triết học Mác - Lênin', 3, NULL, 2, '0', 8),
(15, 0, 'DHIT02', 'Lý thuyết xác suất thống kê toán', 2, NULL, 2, '0', 8),
(19, 0, 'DHCT14', 'Kinh tế chính trị Mác - Lênin', 2, NULL, 3, '0', 8),
(20, 0, 'DHIT01', 'Giải tích', 3, NULL, 1, '0', 8),
(21, 0, 'DHIT18', 'Ngôn ngữ SQL', 3, NULL, 3, '0', 8),
(22, 0, 'DHGS09', 'Giới trong khoa học và công nghệ', 3, NULL, 2, '0', 8),
(23, 0, 'DHCT15', 'Chủ nghĩa xã hội khoa học', 2, NULL, 3, '0', 8),
(25, 0, 'DHIT14', 'Kỹ nghệ phần mềm', 2, NULL, 4, '0', 8),
(26, 0, 'DHIT16', 'Đồ họa máy tính', 2, NULL, 4, '0', 8),
(27, 0, 'DHIT09', 'Cấu trúc dữ liệu và giải thuật', 3, NULL, 4, '0', 8),
(28, 0, 'DHCT16', 'Lịch sử Đảng Cộng sản Việt Nam', 2, NULL, 4, '0', 8),
(29, 0, 'DHIT07', 'Phân tích thiết kế hệ thống thông tin', 3, NULL, 4, '0', 8),
(30, 0, 'DHCT17', 'Tư tưởng Hồ Chí Minh', 2, NULL, 4, '0', 8),
(31, 0, 'DHIT06', 'Phương pháp tính toán số', 3, NULL, 4, '0', 8),
(32, 0, 'DHIT05', 'Toán rời rạc', 3, NULL, 4, '0', 8),
(33, 0, 'DHNT31', 'Tiếng Anh chuyên ngành CNTT', 2, NULL, 5, '0', 8),
(34, 0, 'DHIT12', 'Lập trình hướng đối tượng', 3, NULL, 5, '0', 8),
(35, 0, 'DHIT26', 'An toàn và bảo mật thông tin', 2, NULL, 5, '0', 8),
(36, 0, 'DHPR28', 'Thương mại điện tử', 3, NULL, 5, '0', 8),
(37, 0, 'DHIT13', 'Môi trường lập trình trực quan VB, VBA', 3, NULL, 5, '0', 8),
(38, 0, 'DHTH61', 'Khởi nghiệp kinh doanh', 3, NULL, 5, '0', 8),
(39, 2, 'DHIT37', 'Trí tuệ nhân tạo', 2, NULL, 6, '0', 8),
(40, 0, 'DHIT31', 'Lập trình trên thiết bị di động', 2, NULL, 6, '1', 8),
(41, 0, 'DHIT25', 'Phân tích dữ liệu lớn', 3, NULL, 6, '0', 8),
(42, 1, 'DHIT34', 'Đảm bảo chất lượng và kiểm thử phần mềm', 2, NULL, 7, '0', 8),
(43, 0, 'DHIT32', 'Ngôn ngữ mô hình hóa UML', 2, NULL, 6, '1', 8),
(44, 0, 'DHIT27', 'Thực tập nghề nghiệp', 3, NULL, 6, '0', 8),
(45, 1, 'DHIT21', 'Thiết kế phần mềm ứng dụng Web', 3, NULL, 6, '0', 8),
(46, 1, 'DHIT22', 'Kiểm thử và bảo mật ứng dụng Web', 2, NULL, 6, '0', 8),
(47, 0, 'DHIT24', 'Phát triển phần mềm hướng dịch vụ', 2, NULL, 7, '0', 8),
(48, 0, 'DHIT44', 'Thực tập tốt nghiệp', 6, NULL, 8, '0', 8),
(49, 1, 'DHIT35', 'Lập trình hệ thống nhúng', 2, NULL, 7, '0', 8),
(50, 3, 'DHIT23', 'Mạng không dây và di động', 3, NULL, 7, '0', 8),
(51, 1, 'DHIT36', 'Khai thác phần mềm ứng dụng', 2, NULL, 7, '0', 8),
(52, 0, 'DHIT38', 'Thực tập chuyên ngành', 4, NULL, 7, '0', 8),
(53, 1, 'DHIT20', 'Các vấn đề hiện đại của Công nghệ phần mềm', 2, NULL, 7, '0', 8),
(54, 0, 'DHIT47', 'Ứng dụng cơ sở dữ liệu trên nền web', 3, NULL, 8, '2', 8),
(55, 0, 'DHIT46', 'Quản trị dự án phần mềm', 3, NULL, 8, '2', 8),
(56, 0, 'DHLD56', 'Pháp luật đại cương về truyền thông', 2, NULL, 1, '0', 8),
(57, 0, 'DHNC09', 'Thực hiện đề tài khoa học sinh viên', 2, NULL, 6, '1', 8),
(58, 0, 'DHTH01', 'Kỹ năng xây dựng và phát triển nhóm làm việc', 2, NULL, 6, '1', 8),
(59, 0, 'DHTL19', 'Kỹ năng tư duy', 2, NULL, 6, '1', 8),
(60, 0, 'DHIT30', 'Thực hành dự án phát triển phần mềm', 2, NULL, 6, '1', 8),
(61, 0, 'DHIT28', 'Hệ CSDL đa phương tiện', 2, NULL, 6, '1', 8),
(62, 2, 'DHIT29', 'Tương tác người - máy', 2, NULL, 6, '0', 8),
(63, 3, 'DHIT39', 'Lập trình mạng', 2, NULL, 6, '0', 8),
(64, 3, 'DHIT42', 'An toàn mạng', 2, NULL, 7, '0', 8),
(65, 3, 'DHIT41', 'Đánh giá hiệu năng mạng', 2, NULL, 7, '0', 8),
(66, 3, 'DHIT40', 'Quản trị mạng', 2, NULL, 7, '0', 8),
(67, 0, 'DHIT45', 'Khóa luận tốt nghiệp', 6, NULL, 8, '2', 8);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `submissions`
--

CREATE TABLE `submissions` (
  `id` int(11) NOT NULL,
  `assignment_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `submission_text` text DEFAULT NULL,
  `file_path` varchar(255) DEFAULT NULL,
  `submitted_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `grade` float DEFAULT NULL,
  `feedback` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `account`
--
ALTER TABLE `account`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `assignments`
--
ALTER TABLE `assignments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_assign_subject` (`class_id`);

--
-- Chỉ mục cho bảng `attendance`
--
ALTER TABLE `attendance`
  ADD PRIMARY KEY (`id`),
  ADD KEY `session_id` (`session_id`),
  ADD KEY `student_id` (`student_id`);

--
-- Chỉ mục cho bảng `classes`
--
ALTER TABLE `classes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_class_group` (`class_code`,`group_id`,`semester`),
  ADD KEY `fk_classes_subjects` (`subject_id`),
  ADD KEY `fk_account_teacher` (`account_id`);

--
-- Chỉ mục cho bảng `class_members`
--
ALTER TABLE `class_members`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_member_class` (`class_id`),
  ADD KEY `fk_member_student` (`student_id`);

--
-- Chỉ mục cho bảng `class_results`
--
ALTER TABLE `class_results`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account_id` (`account_id`),
  ADD KEY `class_id` (`class_id`);

--
-- Chỉ mục cho bảng `class_sessions`
--
ALTER TABLE `class_sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `class_id` (`class_id`);

--
-- Chỉ mục cho bảng `curriculum`
--
ALTER TABLE `curriculum`
  ADD PRIMARY KEY (`id`),
  ADD KEY `curriculum_ibfk_1` (`major_id`);

--
-- Chỉ mục cho bảng `exam_participants`
--
ALTER TABLE `exam_participants`
  ADD PRIMARY KEY (`id`),
  ADD KEY `exam_session_id` (`exam_session_id`),
  ADD KEY `student_id` (`student_id`);

--
-- Chỉ mục cho bảng `exam_sessions`
--
ALTER TABLE `exam_sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `class_id` (`class_id`);

--
-- Chỉ mục cho bảng `faculties`
--
ALTER TABLE `faculties`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `forums`
--
ALTER TABLE `forums`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_forum_user` (`account_id`),
  ADD KEY `fk_forum_subject` (`class_id`);

--
-- Chỉ mục cho bảng `leave_requests`
--
ALTER TABLE `leave_requests`
  ADD PRIMARY KEY (`id`),
  ADD KEY `student_id` (`student_id`),
  ADD KEY `class_id` (`class_id`);

--
-- Chỉ mục cho bảng `majors`
--
ALTER TABLE `majors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `major_code` (`major_code`),
  ADD KEY `fk_majors_faculties` (`faculty_id`);

--
-- Chỉ mục cho bảng `major_registrations`
--
ALTER TABLE `major_registrations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account_id` (`account_id`),
  ADD KEY `major_id` (`major_id`);

--
-- Chỉ mục cho bảng `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `class_id` (`class_id`);

--
-- Chỉ mục cho bảng `profile`
--
ALTER TABLE `profile`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_profile_account` (`account_id`),
  ADD KEY `fk_major_profile` (`major_id`),
  ADD KEY `fk_faculty_profile` (`faculty_id`);

--
-- Chỉ mục cho bảng `re_exam_requests`
--
ALTER TABLE `re_exam_requests`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account_id` (`account_id`),
  ADD KEY `subject_id` (`subject_id`),
  ADD KEY `grade_id` (`grade_id`);

--
-- Chỉ mục cho bảng `schedule`
--
ALTER TABLE `schedule`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_sched_subject` (`class_id`);

--
-- Chỉ mục cho bảng `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`id`),
  ADD KEY `major_id` (`major_id`);

--
-- Chỉ mục cho bảng `submissions`
--
ALTER TABLE `submissions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `assignment_id` (`assignment_id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `account`
--
ALTER TABLE `account`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT cho bảng `assignments`
--
ALTER TABLE `assignments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT cho bảng `attendance`
--
ALTER TABLE `attendance`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=541;

--
-- AUTO_INCREMENT cho bảng `classes`
--
ALTER TABLE `classes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;

--
-- AUTO_INCREMENT cho bảng `class_members`
--
ALTER TABLE `class_members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=311;

--
-- AUTO_INCREMENT cho bảng `class_results`
--
ALTER TABLE `class_results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=135;

--
-- AUTO_INCREMENT cho bảng `class_sessions`
--
ALTER TABLE `class_sessions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=819;

--
-- AUTO_INCREMENT cho bảng `curriculum`
--
ALTER TABLE `curriculum`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT cho bảng `exam_participants`
--
ALTER TABLE `exam_participants`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `exam_sessions`
--
ALTER TABLE `exam_sessions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT cho bảng `faculties`
--
ALTER TABLE `faculties`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT cho bảng `forums`
--
ALTER TABLE `forums`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `leave_requests`
--
ALTER TABLE `leave_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `majors`
--
ALTER TABLE `majors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT cho bảng `major_registrations`
--
ALTER TABLE `major_registrations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `profile`
--
ALTER TABLE `profile`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- AUTO_INCREMENT cho bảng `re_exam_requests`
--
ALTER TABLE `re_exam_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `schedule`
--
ALTER TABLE `schedule`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `subjects`
--
ALTER TABLE `subjects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=68;

--
-- AUTO_INCREMENT cho bảng `submissions`
--
ALTER TABLE `submissions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `assignments`
--
ALTER TABLE `assignments`
  ADD CONSTRAINT `fk_assign_subject` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`);

--
-- Các ràng buộc cho bảng `attendance`
--
ALTER TABLE `attendance`
  ADD CONSTRAINT `attendance_ibfk_1` FOREIGN KEY (`session_id`) REFERENCES `class_sessions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `attendance_ibfk_2` FOREIGN KEY (`student_id`) REFERENCES `account` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `classes`
--
ALTER TABLE `classes`
  ADD CONSTRAINT `fk_account_teacher` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`),
  ADD CONSTRAINT `fk_classes_subjects` FOREIGN KEY (`subject_id`) REFERENCES `subjects` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `class_members`
--
ALTER TABLE `class_members`
  ADD CONSTRAINT `fk_member_class` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_member_student` FOREIGN KEY (`student_id`) REFERENCES `account` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `class_results`
--
ALTER TABLE `class_results`
  ADD CONSTRAINT `class_results_ibfk_1` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `class_results_ibfk_2` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `class_sessions`
--
ALTER TABLE `class_sessions`
  ADD CONSTRAINT `class_sessions_ibfk_1` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `curriculum`
--
ALTER TABLE `curriculum`
  ADD CONSTRAINT `curriculum_ibfk_1` FOREIGN KEY (`major_id`) REFERENCES `majors` (`id`);

--
-- Các ràng buộc cho bảng `exam_participants`
--
ALTER TABLE `exam_participants`
  ADD CONSTRAINT `exam_participants_ibfk_1` FOREIGN KEY (`exam_session_id`) REFERENCES `exam_sessions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `exam_participants_ibfk_2` FOREIGN KEY (`student_id`) REFERENCES `account` (`id`);

--
-- Các ràng buộc cho bảng `exam_sessions`
--
ALTER TABLE `exam_sessions`
  ADD CONSTRAINT `exam_sessions_ibfk_1` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`);

--
-- Các ràng buộc cho bảng `forums`
--
ALTER TABLE `forums`
  ADD CONSTRAINT `fk_forum_subject` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`),
  ADD CONSTRAINT `fk_forum_user` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`);

--
-- Các ràng buộc cho bảng `leave_requests`
--
ALTER TABLE `leave_requests`
  ADD CONSTRAINT `leave_requests_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `profile` (`account_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `leave_requests_ibfk_2` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `majors`
--
ALTER TABLE `majors`
  ADD CONSTRAINT `fk_majors_faculties` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `major_registrations`
--
ALTER TABLE `major_registrations`
  ADD CONSTRAINT `major_registrations_ibfk_1` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`),
  ADD CONSTRAINT `major_registrations_ibfk_2` FOREIGN KEY (`major_id`) REFERENCES `majors` (`id`);

--
-- Các ràng buộc cho bảng `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `notifications_ibfk_1` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `profile`
--
ALTER TABLE `profile`
  ADD CONSTRAINT `fk_faculty_profile` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`),
  ADD CONSTRAINT `fk_major_profile` FOREIGN KEY (`major_id`) REFERENCES `majors` (`id`),
  ADD CONSTRAINT `fk_profile_account` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `re_exam_requests`
--
ALTER TABLE `re_exam_requests`
  ADD CONSTRAINT `re_exam_requests_ibfk_1` FOREIGN KEY (`account_id`) REFERENCES `account` (`id`),
  ADD CONSTRAINT `re_exam_requests_ibfk_2` FOREIGN KEY (`subject_id`) REFERENCES `subjects` (`id`),
  ADD CONSTRAINT `re_exam_requests_ibfk_3` FOREIGN KEY (`grade_id`) REFERENCES `exam_sessions` (`id`);

--
-- Các ràng buộc cho bảng `schedule`
--
ALTER TABLE `schedule`
  ADD CONSTRAINT `fk_sched_subject` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `subjects`
--
ALTER TABLE `subjects`
  ADD CONSTRAINT `subjects_ibfk_1` FOREIGN KEY (`major_id`) REFERENCES `majors` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `submissions`
--
ALTER TABLE `submissions`
  ADD CONSTRAINT `submissions_ibfk_1` FOREIGN KEY (`assignment_id`) REFERENCES `assignments` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
